MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.c
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_dma.c
  * @brief   This file provides DMA (Direct Memory Access) peripheral services.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

#if (defined (LPDMA1) || defined (LPDMA2))
#if defined (USE_HAL_DMA_MODULE) && (USE_HAL_DMA_MODULE == 1)

/** @addtogroup DMA
  * @{
  */
/** @defgroup DMA_Introduction DMA Introduction
  * @{

In STM32 microcontrollers, the Direct Memory Access (DMA) controller enables data transfers between peripherals
and memory or between memory regions.
It supports multiple channels, programmable priority levels, and circular buffer management (circular mode).
A transfer can be associated with a peripheral request.

Event generation and interrupt configuration are available per channel, based on various conditions.

Additional features can be activated, including triggered channels (where the trigger can be a peripheral event
or a DMA channel event) and data-handling operations.

Support for privileged and unprivileged DMA transfers is available independently at the channel level.

For more information on linked list operations and queue management, refer to the Q Drivers.

  */
/**
  * @}
  */

/** @defgroup DMA_How_To_Use DMA How To Use
  * @{

This file provides firmware functions to manage the following DMA peripheral functionalities:

- Initialization and de-initialization functions
- Configuration functions
- Linked list node management functions
- Process management functions
- Callback functions
- Status functions

The direct memory access (DMA) controller is a bus master and system peripheral. It performs programmable
data transfers between memory-mapped peripherals and/or memories via linked list upon the control of an off-loaded CPU.

# DMA main features

- DMA transfer modes are divided into two major categories (direct transfer and linked list transfer)

- The DMA channel can be programmed to allow one-shot transfers using direct mode transfer APIs

- Alternatively to the direct programming mode, a DMA channel can be programmed by a list of transfers, known as
  linked list (list of Node items).
  - Each node is defined by its data structure
  - Each node specifies a standalone DMA channel transfer
  When enabled, the DMA channel fetches the first linked list node from SRAM (known as head node).
  After execution, the next linked list node is fetched and executed.
  This operation is repeated until the end of the whole linked list queue.
  The linked list can be linear, where the last linked list queue node is not linked to another queue node,
  or circular, where the last linked list node is linked to any linked list queue node.

  - Linear linked list:
    A linear linked list is a finite list where the last node (also called the tail node) points to NULL.
    A linear linked list transfer execution is finite and ends at the last node.
    The DMA channel fetches and executes the DMA linked list queue from the first node (head node) to the last node
    (tail node) once.
    When the last node is completed, the DMA channel remains idle and another transfer can be launched.

  - Circular linked list:
    A circular linked list is a list where the last node points to one of the previous nodes of the list.
    A circular linked list transfer execution must loop from the last node (tail node) to the node
    where the tail node points to.
    The DMA channel fetches and executes the DMA linked list queue from the first node (head node) to the last node
    (tail node). When the circular node is executed, the DMA channel fetches the next node and repeats the same
    sequence in an infinite loop (circular transfer). To stop the DMA channel, an abort operation is required.

  - Use the stm32tnxx_hal_q module to create a DMA queue based on DMA transfer nodes

- To reduce linked list queue execution time and power consumption, the DMA channel supports executing the
  dynamic linked list format. In fact, the DMA supports the execution of two types of linked list formats: static and
  dynamic.

  - Static linked list:
    The static linked list format refers to the full linked list node where all DMA channel parameters are fetched and
    executed independently of the redundancy of information.

  - Dynamic linked list:
    The dynamic linked list format refers to the customized linked list node where only DMA channel necessary parameters
    are fetched and executed (Example: data size = 20 on previous node, and data size = 20 on the current node => no
    need to update it).

- For linked list transfers, the DMA channel can execute the linked list queue node by node when started. Enable the
  DMA channel once to fetch the head node from memory, then it stops. Enable the DMA channel again to execute the node.
  After that, keep enabling the DMA channel to execute each node until the end of the linked list queue. When the
  linked list queue is circular, enable the DMA channel in an infinite loop to keep the DMA channel running. This
  feature is useful for debugging purposes or asynchronously executing queue nodes.

- Each DMA channel transfer (direct or linked list), is highly configurable according to DMA channel instance
  integrated in devices. These configurations can be:

