MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.c
  - Trigger configuration:
    The DMA channel transfers can be conditioned by hardware signal edges (rising or falling) named hardware triggers.
    Trigger conditions can be applied at:
    - Single/Burst level   : Each single/burst data transmission is conditioned by a signal trigger hit.
    - Block level          : Each block data transmission is conditioned by a signal trigger hit.
    - Node level           : Each node execution is conditioned by a signal trigger hit.
    The DMA channel can report a trigger overrun when it detects more than 2 trigger signal edges before executing the
    current transfer.

  - Data handling configuration:
    The data handling feature can be:
    - Padding pattern: Pad with the selected pattern (zero padding or sign extension) when the source data width is
                        smaller than the destination data width at single level.
    - Truncation     : Truncate data from the source when the source data width is larger than the destination data
                        width at single level.

- Each DMA channel transfer (direct or linked list), when it is active, can be suspended and
  resumed at run time by the application.
  When suspending an ongoing transfer, the DMA channel is not suspended immediately but completes the current
  single/burst transfer, then stops.
  When the DMA channel is suspended, the current transfer can be resumed immediately.

- A DMA burst means moving several pieces of data at once, instead of one by one (single transfer).

- A DMA block is a larger chunk of data that the DMA will move from one place to another. It can be made up
  of several bursts or single transfers.

# How to use the DMA HAL module driver

## Initialization and de-initialization:

- For a given channel, call the function HAL_DMA_Init() to initialize the DMA channel handle and associate the physical
  channel instance as direct mode by default.

- Call the function HAL_DMA_DeInit() to de-initialize a DMA channel.
After this function is called, the DMA channel is in reset.
It is mandatory to reinitialize it for the next transfer.

## Transfer configuration:

### Set the DMA channel direct transfer configuration

- HAL_DMA_SetConfigDirectXfer() function for the direct transfer mode.

- Optional: set the DMA channel direct transfer feature configuration:

  - Call the function HAL_DMA_SetConfigDirectXferHardwareRequestMode() to set the transfer hardware request mode
    configuration
  - Call the function HAL_DMA_SetConfigDirectXferFlowControlMode() to set the transfer flow control mode configuration
  - Call the function HAL_DMA_SetConfigDirectXferTrigger() to set the transfer trigger configuration
  - Call the function HAL_DMA_SetConfigDirectXferDataHandling() to set the transfer data handling configuration

  - Use the reset functions to reset each feature configuration (for example, HAL_DMA_ResetConfigDirectXferTrigger)

  - Use the get functions to get the configuration of any feature (for example, HAL_DMA_GetConfigDirectXfer)

  - Call the function HAL_DMA_SetConfigPeriphDirectXfer() to set the direct peripheral transfer configuration

### Set the DMA channel linked list transfer configuration

- HAL_DMA_SetConfigLinkedListXfer() function for the linked list transfer mode

- Optional: set the DMA channel linked list transfer feature configuration:

  - Call the function HAL_DMA_SetLinkedListXferEventMode() to set the transfer event mode configuration
  - Call the function HAL_DMA_SetLinkedListXferPriority() to set the transfer priority configuration
  - Call the function HAL_DMA_SetLinkedListXferExecutionMode() to set the transfer execution mode configuration

  - Use the reset functions to reset each feature configuration (for example, HAL_DMA_ResetLinkedListXferEventMode)

  - Use the get functions to get the configuration of any feature (for example, HAL_DMA_GetConfigLinkedListXfer)

  - Call the function HAL_DMA_SetConfigPeriphLinkedListCircularXfer() to set linked list circular peripheral transfer
    configuration

## Linked list node management:

- The linked list node management is a software process independent of DMA channel hardware. Use it to fill,
  convert (to dynamic or to static) nodes and use the Q module services to:
  - Initialize the queue
  - Insert a node into the queue
  - Remove a node from the queue
  - Replace a node in the queue
  - Circularize queue in order to perform infinite transfers.
  Linked list APIs and types are adapted to reduce memory footprint.

- At node level, the operations are filling a new linked list node or getting linked list node information from a
  filled node. The linked list nodes have two forms based on 2D addressing capability. The linear addressing nodes
  contain the information of all DMA channel features except the 2D addressing features, and the 2D addressing nodes
  contain the information of all available features.

  - Call the function HAL_DMA_FillNodeConfig() to fill the DMA linked list node according to the specified parameters.
    The fill operation converts the specified parameters into values recognized by the DMA channel and stores them
    in memory.
    When placing the DMA linked list in SRAM, ensure compliance with the product specifications to guarantee proper
    memory access.
    The DMA linked list node parameter address must be 32-bit aligned and
    must not exceed the 64 KB addressable space.

  - Call the function HAL_DMA_GetNodeConfig() to get the specified configuration parameter on filling node.
    This API can be used when a few parameters need to be changed to fill a new node.

  - As optional, fill the DMA channel linked list node feature configuration :

    - Call the function HAL_DMA_FillNodeHardwareRequestMode() to fill the DMA linked list node request mode
      configuration
    - Call the function HAL_DMA_FillNodeFlowControlMode() to fill the DMA linked list node flow control mode
      configuration
    - Call the function HAL_DMA_FillNodeXferEventMode() to fill the DMA linked list node transfer event mode
      configuration
    - Call the function HAL_DMA_FillNodeTrigger() to fill the DMA linked list node trigger configuration
    - Call the function HAL_DMA_FillNodeDataHandling() to fill the DMA linked list node data handling configuration
    - Call the function HAL_DMA_FillNodeData() to fill the DMA linked list node data configuration
    - Call the function HAL_DMA_FillNodeDirectXfer() to fill the DMA linked list node direct transfer configuration

  - To optimize DMA channel linked list queue execution, convert the built linked list queue to dynamic format
    (static is the default format). When the linked list queue becomes dynamic, all queue nodes are optimized and
    only changed parameters are updated between nodes. As a result, the DMA fetches only changed parameters instead
    of the whole node.

    - Call the function HAL_DMA_ConvertQNodesToDynamic() to convert a linked list queue to dynamic format.
      - Call this API for static queue format.
      - Call this API as the last API before starting the DMA channel in linked list mode.

