MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.c
    - Call the function HAL_DMA_ConvertQNodesToStatic() to convert a linked list queue to static format.
       - Call this API for dynamic queue format.
       - If the execution is dynamic and an update is needed on the linked list queue, then:
        - If the execution is linear   : Call this API as the first API after the full execution of
          linked list queue.
        - If the execution is circular : Call this API as the first API after aborting the execution of
          the current linked list queue.

  - When converting a circular queue to dynamic format and when the first circular node is the last queue node, it is
    recommended to duplicate the last circular node to ensure full optimization when calling
    HAL_DMA_ConvertQNodesToDynamic() API. In this case, the updated information is only addresses, which reduces
    4 words of update for linear nodes per node execution and 6 words of update for 2D addressing nodes per
    node execution.

## Process and callback management :

### Silent mode IO operation:

- Call the function HAL_DMA_StartDirectXfer() to start a DMA transfer in direct mode after the configuration of source
  address, destination address and the size of data to be transferred.

- Call the function HAL_DMA_StartLinkedListXfer() to start a DMA transfer in linked list mode after the configuration of
  linked list queue.

- Call the function HAL_DMA_PollForXfer() to poll for selected transfer level. In this case, configure a fixed timeout
  based on the application.
  Transfer level can be :
  - HAL_DMA_XFER_HALF_COMPLETE
  - HAL_DMA_XFER_FULL_COMPLETE
  For circular transfer, this API returns HAL_INVALID_PARAM.

- Call the function HAL_DMA_Suspend() to suspend any ongoing DMA transfer in blocking mode.
  This API returns HAL_ERROR when there is no ongoing transfer or timeout is reached when disabling the DMA channel.
  Do not call this API from an interrupt service routine.

- Call the function HAL_DMA_Resume() to resume any suspended DMA transfer immediately.

- Call the function HAL_DMA_Abort() to abort any ongoing DMA transfer in blocking mode.
  This API returns HAL_ERROR when there is no ongoing transfer or timeout is reached when disabling the DMA channel.
  This API accepts the idle state when trying to abort a yet finished transfer. It returns HAL_ERROR in this case.
  Do not call this API from an interrupt service routine.

### Interrupt mode IO operation:

- Configure the DMA interrupt priority using HAL_CORTEX_NVIC_SetPriority() function

- Enable the DMA IRQ handler using HAL_CORTEX_NVIC_EnableIRQ() function

- Call the function HAL_DMA_RegisterXferHalfCpltCallback() to register half transfer complete user callbacks.
- Call the function HAL_DMA_RegisterXferCpltCallback() to register transfer complete user callbacks.
- Call the function HAL_DMA_RegisterXferAbortCallback() to register transfer abort user callbacks.
- Call the function HAL_DMA_RegisterXferSuspendCallback() to register transfer suspend user callbacks.
- Call the function HAL_DMA_RegisterXferErrorCallback() to register transfer error user callbacks.

- Call the function HAL_DMA_StartDirectXfer_IT() to start the DMA transfer in direct mode after enabling the DMA
  default optional interrupts and the configuration of source address, destination address and the size of data
  to be transferred.

- Call the function HAL_DMA_StartDirectXfer_IT_Opt() to start the DMA transfer in direct mode after enabling the DMA
  customized optional interrupts and the configuration of source address, destination address and the size of data
  to be transferred.

- Call the function HAL_DMA_StartPeriphXfer_IT_Opt() to start a DMA channel peripheral transfer in direct or circular
  mode according to source address, destination address and the size of data to be transferred in byte parameters after
  enabling of the DMA channel mandatory interrupts for the process and enabling or disabling of the DMA channel optional
  interrupts for the process.\n
  Note: This function is intended exclusively for internal use by HAL PPP drivers for transfers over DMA.

- Call the function HAL_DMA_StartLinkedListXfer_IT() to start a DMA transfer in linked list mode after enabling the DMA
  default optional interrupts and configuration of linked list queue.

- Call the function HAL_DMA_StartLinkedListXfer_IT_Opt() to start a DMA transfer in linked list mode after the enable
  of DMA customized optional interrupts and configuration of linked list queue.

- Use HAL_DMA_IRQHandler() in the DMA_IRQHandler interrupt handler to handle DMA interrupts.

- Call the function HAL_DMA_Suspend_IT() to suspend any ongoing DMA transfer in interrupt mode.
  This API suspends the DMA channel execution. When the transfer is effectively suspended, an interrupt
  is generated and HAL_DMA_IRQHandler() must reset the channel and executes the transfer suspend user callbacks.
  Call this API from an interrupt service routine.

- Call the function HAL_DMA_Resume() to resume any suspended DMA transfer immediately.

- Call the function HAL_DMA_Abort_IT() to abort any ongoing DMA transfer in interrupt mode.
  This API suspends the DMA channel execution.
  When the transfer is effectively suspended, an interrupt is generated and HAL_DMA_IRQHandler() must reset the channel
  and executes the transfer abort user callbacks.
  This API accepts the idle state when trying to abort a yet finished transfer. It returns HAL_ERROR in this case.
  This accounts for asynchronous update of the DMA state to idle within the IRQHandler when the transfer is completed.
  Call this API from an interrupt service routine.

## Status and errors

- Call the function HAL_DMA_SetUserData() to set the DMA user data
- Call the function HAL_DMA_GetUserData() to get the DMA user data
- Call the function HAL_DMA_GetDirectXferRemainingDataByte() to get the DMA remaining data in the current transfer
  in byte
- Call the function HAL_DMA_GetState() to get the DMA current state
- Call the function HAL_DMA_GetLastErrorCodes() to get last error codes

  */
/**
  * @}
  */

/** @defgroup DMA_Configuration_Table DMA Configuration Table
  * @{
# Configuration inside the DMA driver

Config defines              | Description     | Default value   | Note                                                 |
----------------------------| --------------- | --------------- | -----------------------------------------------------|
PRODUCT                     | from IDE        |        NA       | The selected device (e.g., STM32C5XXxx)            |
USE_HAL_DMA_MODULE          | from hal_conf.h |        1        | Allows to use HAL DMA module.                        |
USE_ASSERT_DBG_PARAM        | from IDE        |      None       | Allows to use the assert check parameters.           |
USE_ASSERT_DBG_STATE        | from IDE        |      None       | Allows to use the assert check states.               |
USE_HAL_CHECK_PARAM         | from hal_conf.h |        0        | Allows to use the run-time checks parameters.        |
USE_HAL_CHECK_PROCESS_STATE | from hal_conf.h |        0        | Allows to use the load and store exclusive.          |
USE_HAL_DMA_CLK_ENABLE_MODEL| from hal_conf.h |HAL_CLK_ENABLE_NO| Allows to use the clock interface management for DMA.|
USE_HAL_DMA_GET_LAST_ERRORS | from hal_conf.h |        0        | Allows to use error code mechanism.                  |
USE_HAL_DMA_USER_DATA       | from hal_conf.h |        0        | Allows to use user data.                             |
USE_HAL_DMA_LINKEDLIST      | from hal_conf.h |        0        | Allows to use linked list services.                  |
  */
/**
  * @}
  */

/* Private Macros-----------------------------------------------------------------------------------------------------*/
/** @defgroup DMA_Private_Macros DMA Private Macros
  * @{
  */

/**
  * @brief  Check DMA hardware request selection.
  * @param  value DMA hardware request to check.
  * @retval 1U if value is a valid DMA hardware request, 0U otherwise.
  */
#if defined (XSPI1)
#define IS_DMA_REQUEST(value)                                                 \
  (((value) == HAL_DMA_REQUEST_SW) || ((value) <= HAL_LPDMA1_REQUEST_XSPI1))
#elif defined (DAC1) && defined (DAC_NB_OF_CHANNEL) && (DAC_NB_OF_CHANNEL == 2)
#define IS_DMA_REQUEST(value)                                                 \
  (((value) == HAL_DMA_REQUEST_SW) || ((value) <= HAL_LPDMA1_REQUEST_DAC1_CH2))
#else
#define IS_DMA_REQUEST(value)                                                 \
  (((value) == HAL_DMA_REQUEST_SW) || ((value) <= HAL_LPDMA1_REQUEST_DAC1_CH1))
#endif /* XSPI1 */

/**
  * @brief  Check DMA hardware request mode.
  * @param  value DMA hardware request mode to check.
  * @retval 1U if value is a valid DMA hardware request mode, 0U otherwise.
  */
#define IS_DMA_HARDWARE_REQUEST_MODE(value)               \
  (((value) == (uint32_t)HAL_DMA_HARDWARE_REQUEST_BURST ) \
   || ((value) == (uint32_t)HAL_DMA_HARDWARE_REQUEST_BLOCK))

/**
  * @brief  Check DMA flow control mode.
  * @param  value DMA flow control mode to check.
  * @retval 1U if value is a valid DMA flow control mode, 0U otherwise.
  */
#define IS_DMA_FLOW_CONTROL_MODE(value)                 \
  (((value) == (uint32_t)HAL_DMA_FLOW_CONTROL_DMA)      \
   || ((value) == (uint32_t)HAL_DMA_FLOW_CONTROL_PERIPH))
/**
  * @brief  Check DMA transfer direction.
  * @param  value DMA transfer direction to check.
  * @retval 1U if value is a valid DMA transfer direction, 0U otherwise.
  */
#define IS_DMA_DIRECTION(value)                                 \
  (((value) == (uint32_t)HAL_DMA_DIRECTION_MEMORY_TO_MEMORY)    \
   || ((value) == (uint32_t)HAL_DMA_DIRECTION_PERIPH_TO_MEMORY) \
   || ((value) == (uint32_t)HAL_DMA_DIRECTION_MEMORY_TO_PERIPH))

/**
  * @brief  Check DMA source address increment mode.
  * @param  value DMA source address increment mode to check.
  * @retval 1U if value is a valid DMA source increment mode, 0U otherwise.
  */
#define IS_DMA_SRC_INC(value)                            \
  (((value) == (uint32_t)HAL_DMA_SRC_ADDR_FIXED)         \
   || ((value) == (uint32_t)HAL_DMA_SRC_ADDR_INCREMENTED))

/**
  * @brief  Check DMA destination address increment mode.
  * @param  value DMA destination address increment mode to check.
  * @retval 1U if value is a valid DMA destination increment mode, 0U otherwise.
  */
#define IS_DMA_DEST_INC(value)                            \
  (((value) == (uint32_t)HAL_DMA_DEST_ADDR_FIXED)         \
   || ((value) == (uint32_t)HAL_DMA_DEST_ADDR_INCREMENTED))

/**
  * @brief  Check DMA source data width.
  * @param  value DMA source data width to check.
  * @retval 1U if value is a valid DMA source data width, 0U otherwise.
  */
#define IS_DMA_SRC_DATA_WIDTH(value)                         \
  (((value) == (uint32_t)HAL_DMA_SRC_DATA_WIDTH_BYTE)        \
   || ((value) == (uint32_t)HAL_DMA_SRC_DATA_WIDTH_HALFWORD) \
   || ((value) == (uint32_t)HAL_DMA_SRC_DATA_WIDTH_WORD))

/**
  * @brief  Check DMA destination data width.
  * @param  value DMA destination data width to check.
  * @retval 1U if value is a valid DMA destination data width, 0U otherwise.
  */
#define IS_DMA_DEST_DATA_WIDTH(value)                         \
  (((value) == (uint32_t)HAL_DMA_DEST_DATA_WIDTH_BYTE)        \
   || ((value) == (uint32_t)HAL_DMA_DEST_DATA_WIDTH_HALFWORD) \
   || ((value) == (uint32_t)HAL_DMA_DEST_DATA_WIDTH_WORD))

/**
  * @brief  Check DMA priority.
  * @param  value DMA priority to check.
  * @retval 1U if value is a valid DMA priority, 0U otherwise.
  */
#define IS_DMA_PRIORITY(value)                                \
  (((value) == (uint32_t)HAL_DMA_PRIORITY_LOW_WEIGHT_LOW)     \
   || ((value) == (uint32_t)HAL_DMA_PRIORITY_LOW_WEIGHT_MID)  \
   || ((value) == (uint32_t)HAL_DMA_PRIORITY_LOW_WEIGHT_HIGH) \
   || ((value) == (uint32_t)HAL_DMA_PRIORITY_HIGH))

/**
  * @brief  Check DMA trigger source.
  * @param  value DMA trigger source to check.
  * @retval 1U if value is a valid DMA trigger source, 0U otherwise.
  */
#if defined (COMP2)
#define IS_DMA_TRIGGER_SOURCE(value)                \
  ((value) <= (uint32_t)HAL_LPDMA1_TRIGGER_COMP2_OUT)
#elif defined (LPDMA2_CH7)
#define IS_DMA_TRIGGER_SOURCE(value)                    \
  ((value) <= (uint32_t)HAL_LPDMA1_TRIGGER_LPDMA2_CH7_TC)
#else
#define IS_DMA_TRIGGER_SOURCE(value)                    \
  ((value) <= (uint32_t)HAL_LPDMA1_TRIGGER_LPDMA2_CH3_TC)
#endif /* COMP2 */

/**
  * @brief  Check DMA trigger polarity.
  * @param  value DMA trigger polarity to check.
  * @retval 1U if value is a valid DMA trigger polarity, 0U otherwise.
  */
#define IS_DMA_TRIGGER_POLARITY(value)                       \
  (((value) == (uint32_t)HAL_DMA_TRIGGER_POLARITY_MASKED)    \
   || ((value) == (uint32_t)HAL_DMA_TRIGGER_POLARITY_RISING) \
   || ((value) == (uint32_t)HAL_DMA_TRIGGER_POLARITY_FALLING))

/**
  * @brief  Check DMA trigger mode.
  * @param  value DMA trigger mode to check.
  * @retval 1U if value is a valid DMA trigger mode, 0U otherwise.
  */
#define IS_DMA_TRIGGER_MODE(value)                                \
  (((value) == (uint32_t)HAL_DMA_TRIGGER_BLOCK_TRANSFER)          \
   || ((value) == (uint32_t)HAL_DMA_TRIGGER_NODE_TRANSFER)        \
   || ((value) == (uint32_t)HAL_DMA_TRIGGER_SINGLE_BURST_TRANSFER))

/**
  * @brief  Check DMA destination data truncation and padding mode.
  * @param  value DMA destination data truncation and padding mode to check.
  * @retval 1U if value is a valid DMA destination truncation and padding mode, 0U otherwise.
  */
#define IS_DMA_DEST_DATA_TRUNC_PADD(value)                          \
  (((value) == (uint32_t)HAL_DMA_DEST_DATA_TRUNC_LEFT_PADD_ZERO)    \
   || ((value) == (uint32_t)HAL_DMA_DEST_DATA_TRUNC_RIGHT_PADD_SIGN))

/**
  * @brief  Check DMA linked list transfer event mode.
  * @param  value DMA linked list transfer event mode to check.
  * @retval 1U if value is a valid DMA linked list transfer event mode, 0U otherwise.
  */
#define IS_DMA_LINKEDLIST_XFER_EVENT_MODE(value)                \
  (((value) == (uint32_t)HAL_DMA_LINKEDLIST_XFER_EVENT_BLOCK)   \
   || ((value) == (uint32_t)HAL_DMA_LINKEDLIST_XFER_EVENT_NODE) \
   || ((value) == (uint32_t)HAL_DMA_LINKEDLIST_XFER_EVENT_Q))

/**
  * @brief  Check DMA linked list execution mode.
  * @param  value DMA linked list execution mode to check.
  * @retval 1U if value is a valid DMA linked list execution mode, 0U otherwise.
  */
#define IS_DMA_LINKEDLIST_EXEC_MODE(value)                    \
  (((value) == (uint32_t)HAL_DMA_LINKEDLIST_EXECUTION_Q)      \
   || ((value) == (uint32_t)HAL_DMA_LINKEDLIST_EXECUTION_NODE))


/**
  * @brief  Check DMA privilege attribute.
  * @param  value DMA privilege attribute to check.
  * @retval 1U if value is a valid DMA privilege attribute, 0U otherwise.
  */
#define IS_DMA_PRIV_ATTR(value)   \
  (((value) == HAL_DMA_NPRIV)     \
   || ((value) == HAL_DMA_PRIV))

/**
  * @brief  Check DMA optional interrupt selection.
  * @param  value DMA optional interrupt selection to check.
  * @retval 1U if value is a valid optional interrupt selection, 0U otherwise.
  */
#define IS_DMA_OPT_IT(value)              \
  (((value) == HAL_DMA_OPT_IT_NONE)       \
   || ((value) == HAL_DMA_OPT_IT_HT)      \
   || ((value) == HAL_DMA_OPT_IT_TO)      \
   || ((value) == HAL_DMA_OPT_IT_DEFAULT) \
   || ((value) == HAL_DMA_OPT_IT_SILENT))

/**
  * @brief  Check DMA transfer level.
  * @param  value DMA transfer level to check.
  * @retval 1U if value is a valid DMA transfer level, 0U otherwise.
  */
#define IS_DMA_XFER_LEVEL(value)                       \
  (((value) == (uint32_t)HAL_DMA_XFER_FULL_COMPLETE)   \
   || ((value) == (uint32_t)HAL_DMA_XFER_HALF_COMPLETE))

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
/**
  * @brief  Get the DMA node type.
  * @param  instance DMA channel instance.
  * @retval Linear addressing.
  */
#define DMA_GET_NODE_TYPE(instance)  HAL_DMA_NODE_LINEAR_ADDRESSING
#endif /* USE_HAL_DMA_LINKEDLIST */

/**
  * @brief  Get the DMA channel instance.
  * @param  handle DMA handle.
  * @retval DMA channel instance.
  */
#define DMA_CHANNEL_GET_INSTANCE(handle)                \
  ((DMA_Channel_TypeDef *)((uint32_t)(handle)->instance))

/*! Macro to define DMA CTR1 register offset */
#define DMA_NODE_CTR1_REG_OFFSET  LL_DMA_NODE_CTR1_REG_OFFSET

