MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.c
/*! Macro to define DMA CTR2 register offset */
#define DMA_NODE_CTR2_REG_OFFSET  LL_DMA_NODE_CTR2_REG_OFFSET

/*! Macro to define DMA CBR1 register offset */
#define DMA_NODE_CBR1_REG_OFFSET  LL_DMA_NODE_CBR1_REG_OFFSET

/*! Macro to define DMA CSAR register offset */
#define DMA_NODE_CSAR_REG_OFFSET  LL_DMA_NODE_CSAR_REG_OFFSET

/*! Macro to define DMA CDAR register offset */
#define DMA_NODE_CDAR_REG_OFFSET  LL_DMA_NODE_CDAR_REG_OFFSET


/**
  * @}
  */

/* Private constants -------------------------------------------------------------------------------------------------*/
/** @defgroup DMA_Private_Constants DMA Private Constants
  * @{
  */
#define DMA_SUSPEND_TIMEOUT (1U)          /*!< 1 ms is needed to suspend the DMA channel */

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#define HAL_DMA_FLAG_ERROR (LL_DMA_FLAG_DTE | LL_DMA_FLAG_ULE | LL_DMA_FLAG_USE) /*!< DMA Flag error */
#else
#define HAL_DMA_FLAG_ERROR (LL_DMA_FLAG_DTE | LL_DMA_FLAG_USE)                   /*!< DMA Flag error */
#endif /* USE_HAL_DMA_LINKEDLIST */

#define DMA_NODE_CLLR_IDX            (0x0700U)                   /*!< DMA channel node CLLR index mask     */
#define DMA_NODE_CLLR_IDX_POS        (0x0008U)                   /*!< DMA channel node CLLR index position */
#define DMA_NODE_REGISTER_NUM        LL_DMA_NODE_REGISTER_NUM    /*!< DMA channel node register number     */
#define DMA_NODE_STATIC_FORMAT       (0x0000U)                   /*!< DMA channel node static format       */
#define DMA_NODE_DYNAMIC_FORMAT      (0x0001U)                   /*!< DMA channel node dynamic format      */
#define DMA_UPDATE_CLLR_POSITION     (0x0000U)                   /*!< DMA channel update CLLR position     */
#define DMA_UPDATE_CLLR_VALUE        (0x0001U)                   /*!< DMA channel update CLLR value        */
#define DMA_LASTNODE_ISNOT_CIRCULAR  (0x0000U)                   /*!< Last node is not first circular node */
#define DMA_LASTNODE_IS_CIRCULAR     (0x0001U)                   /*!< Last node is first circular node     */
#define DMA_NODE_CSAR_DEFAULT_OFFSET (0x0003U)                   /*!< CSAR default offset                  */

/**
  * @}
  */

/* Private functions -------------------------------------------------------------------------------------------------*/
/** @addtogroup DMA_Private_Functions
  * @{
  */
static void DMA_SetConfigDirectXfer(hal_dma_handle_t *hdma, const hal_dma_direct_xfer_config_t *p_config);

static void DMA_GetConfigDirectXfer(hal_dma_handle_t *hdma, hal_dma_direct_xfer_config_t *p_config);

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
static void DMA_SetConfigLinkedListXfer(hal_dma_handle_t *hdma, const hal_dma_linkedlist_xfer_config_t *p_config);

static void DMA_GetConfigLinkedListXfer(hal_dma_handle_t *hdma, hal_dma_linkedlist_xfer_config_t *p_config);

static void DMA_FillNodeConfig(hal_dma_node_t *p_node, const hal_dma_node_config_t *p_conf,
                               hal_dma_node_type_t node_type);

static void DMA_GetConfigNode(const hal_dma_node_t *p_node, hal_dma_node_config_t *p_conf,
                              hal_dma_node_type_t *p_node_type);

static void DMA_FillNodeDirectXfer(hal_dma_node_t *p_node, const hal_dma_direct_xfer_config_t *p_config,
                                   hal_dma_node_type_t node_type, hal_dma_linkedlist_xfer_event_mode_t xfer_event_mode);

static void DMA_UpdateDataNode(hal_dma_node_t *p_node, uint32_t src_addr, uint32_t dest_addr, uint32_t size_byte);

static void DMA_ConvertQNodesToDynamic(hal_q_t *p_q);

static void DMA_ConvertQNodesToStatic(hal_q_t *p_q);

static void DMA_List_ConvertNodeToDynamic(uint32_t context_node_addr, uint32_t current_node_addr, uint32_t reg_nbr);

static void DMA_List_ConvertNodeToStatic(uint32_t context_node_addr, uint32_t current_node_addr, uint32_t reg_nbr);

static void DMA_List_UpdateDynamicQueueNodesCLLR(const hal_q_t *p_q, uint32_t last_node_is_circular);

static void DMA_List_UpdateStaticQueueNodesCLLR(hal_q_t *p_q, uint32_t operation);

static void DMA_List_GetCLLRNodeInfo(const hal_dma_node_t *p_node, uint32_t *p_cllr_mask, uint32_t *p_cllr_offset);

static void DMA_List_FormatNode(hal_dma_node_t *p_node, uint32_t reg_idx, uint32_t reg_nbr, uint32_t format);

static void DMA_List_ClearUnusedFields(hal_dma_node_t *p_node, uint32_t first_unused_field);
#endif /* USE_HAL_DMA_LINKEDLIST */

static void DMA_StartDirectXfer(hal_dma_handle_t *hdma, uint32_t src_addr, uint32_t dest_addr, uint32_t size_byte,
                                uint32_t interrupts);

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
static void DMA_StartLinkedListXfer(hal_dma_handle_t *hdma, const void *p_head_node, uint32_t interrupts);
#endif /* USE_HAL_DMA_LINKEDLIST */

static void DMA_HandleErrorIT(hal_dma_handle_t *hdma, uint32_t error_msk);
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup DMA_Exported_Functions
  * @{
  */

/** @addtogroup DMA_Exported_Functions_Group1
  * @{
This subsection provides a set of functions to initialize and de-initialize a DMA channel peripheral:

- Call the function HAL_DMA_Init() to initialize the DMA channel handle and associate a physical channel instance.
  (As optional, DMA clock is enabled inside the function)

- Call the function HAL_DMA_DeInit() to restore the physical and logical default configuration (after reset) of
  the selected DMA channel peripheral.

  */

/**
  * @brief  Initialize the DMA channel handle and associate physical channel instance.
  * @param  hdma              Pointer to DMA channel handle
  * @param  instance          DMA channel instance
  * @retval HAL_INVALID_PARAM Invalid parameter when hdma pointer is NULL
  * @retval HAL_OK            DMA channel is successfully initialized
  */
hal_status_t HAL_DMA_Init(hal_dma_handle_t *hdma, hal_dma_channel_t instance)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(IS_DMA_ALL_INSTANCE((DMA_Channel_TypeDef *)((uint32_t)instance)));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

