MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.c
  hdma->instance = instance;

#if defined(USE_HAL_DMA_CLK_ENABLE_MODEL) && (USE_HAL_DMA_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  if (LL_DMA_GET_INSTANCE(hdma->instance) == LPDMA1)
  {
    HAL_RCC_LPDMA1_EnableClock();
  }
#if defined(LPDMA2)
  else
  {
    HAL_RCC_LPDMA2_EnableClock();
  }
#endif /* LPDMA2 */
#endif /* USE_HAL_DMA_CLK_ENABLE_MODEL */

  hdma->p_xfer_halfcplt_cb = HAL_DMA_XferHalfCpltCallback;
  hdma->p_xfer_cplt_cb     = HAL_DMA_XferCpltCallback;
  hdma->p_xfer_abort_cb    = HAL_DMA_XferAbortCallback;
  hdma->p_xfer_suspend_cb  = HAL_DMA_XferSuspendCallback;
  hdma->p_xfer_error_cb    = HAL_DMA_XferErrorCallback;

#if defined(USE_HAL_DMA_USER_DATA) && (USE_HAL_DMA_USER_DATA == 1)
  hdma->p_user_data = NULL;
#endif /* USE_HAL_DMA_USER_DATA */

#if defined (USE_HAL_DMA_GET_LAST_ERRORS) && (USE_HAL_DMA_GET_LAST_ERRORS == 1)
  hdma->last_error_codes = HAL_DMA_ERROR_NONE;
#endif /* USE_HAL_DMA_GET_LAST_ERRORS */

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  hdma->xfer_mode = HAL_DMA_XFER_MODE_DIRECT;
#endif /* USE_HAL_DMA_LINKEDLIST */

  hdma->global_state = HAL_DMA_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief Deinitialize the DMA channel handle and the associated physical channel instance.
  * @param hdma Pointer to DMA channel handle
  */
void HAL_DMA_DeInit(hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(IS_DMA_ALL_INSTANCE(DMA_CHANNEL_GET_INSTANCE(hdma)));

  LL_DMA_DisableChannel(DMA_CHANNEL_GET_INSTANCE(hdma));
  LL_DMA_ClearFlag(DMA_CHANNEL_GET_INSTANCE(hdma), LL_DMA_FLAG_ALL);

  LL_DMA_WRITE_REG(DMA_CHANNEL_GET_INSTANCE(hdma), CCR, 0U);
  LL_DMA_WRITE_REG(DMA_CHANNEL_GET_INSTANCE(hdma), CTR1, 0U);
  LL_DMA_WRITE_REG(DMA_CHANNEL_GET_INSTANCE(hdma), CTR2, 0U);
  LL_DMA_WRITE_REG(DMA_CHANNEL_GET_INSTANCE(hdma), CBR1, 0U);
  LL_DMA_WRITE_REG(DMA_CHANNEL_GET_INSTANCE(hdma), CLLR, 0U);

  hdma->global_state = HAL_DMA_STATE_RESET;
}

/**
  * @brief Retrieve the HAL DMA channel instance.
  * @param hdma Pointer to DMA channel handle.
  * @retval DMA channel instance, element in @ref hal_dma_channel_t  enumeration.
  */
hal_dma_channel_t HAL_DMA_GetInstance(const hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);

  return hdma->instance;
}

/**
  * @brief Retrieve the LL DMA channel instance.
  * @param hdma Pointer to DMA channel handle.
  * @retval DMA channel instance.
  */
DMA_Channel_TypeDef *HAL_DMA_GetLLInstance(const hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  return ((DMA_Channel_TypeDef *)((uint32_t)((hdma)->instance)));
}

/**
  * @}
  */

/** @addtogroup DMA_Exported_Functions_Group2
  * @{

This subsection provides a set of functions to configure the DMA channel peripheral:

  Basic transfer configuration

- Call the function HAL_DMA_SetConfigDirectXfer() to configure the DMA channel basic transfer according to configured
  parameter within hal_dma_direct_xfer_config_t structure

- Call the function HAL_DMA_GetConfigDirectXfer() to get the current configured basic transfer

  Hardware request mode transfer configuration

- Call the function HAL_DMA_SetConfigDirectXferHardwareRequestMode() to configure the DMA channel transfer hardware
  request mode according to configured parameters

- Call the function HAL_DMA_ResetConfigDirectXferHardwareRequestMode() to reset the DMA channel transfer hardware
  request mode configuration

- Call the function HAL_DMA_GetConfigDirectXferHardwareRequestMode() to get the current configured transfer hardware
  request mode

  Flow control mode configuration

- Call the function HAL_DMA_SetConfigDirectXferFlowControlMode() to configure the DMA channel flow control mode

- Call the function HAL_DMA_ResetConfigDirectXferFlowControlMode() to reset the DMA channel flow control mode

- Call the function HAL_DMA_GetConfigDirectXferFlowControlMode() to get the current configured transfer flow
  control mode

  Trigger transfer configuration

- Call the function HAL_DMA_SetConfigDirectXferTrigger() to configure the DMA channel trigger according to configured
  parameter within hal_dma_trigger_config_t structure

- Call the function HAL_DMA_ResetConfigDirectXferTrigger() to reset the DMA channel transfer trigger configuration

- Call the function HAL_DMA_GetConfigDirectXferTrigger() to get the current configured trigger

  Data handling transfer configuration

- Call the function HAL_DMA_SetConfigDirectXferDataHandling() to configure the DMA channel data handling according to
  configured parameter within hal_dma_data_handling_config_t structure

- Call the function HAL_DMA_ResetConfigDirectXferDataHandling() to reset the DMA channel transfer data handling
  configuration

- Call the function HAL_DMA_GetConfigDirectXferDataHandling() to get the current configured data handling


  Channel privilege attribute configuration

- Call the function HAL_DMA_SetPrivAttr() to configure the DMA channel privileged access level attribute

- Call the function HAL_DMA_GetPrivAttr() to get the DMA channel privileged access level attribute

  Channel lock attributes configuration

- Call the function HAL_DMA_LockAttr() to lock the DMA channel privileged access level attribute

- Call the function HAL_DMA_IsLockedAttr() to check the DMA channel privileged access level attribute lock

  Peripherals direct transfer configuration

- Call the function HAL_DMA_SetConfigPeriphDirectXfer() to configure the DMA channel peripheral direct transfer
  according to configured parameter within hal_dma_direct_xfer_config_t structure:

- Call the function HAL_DMA_GetConfigPeriphDirectXfer() to get the current configured direct transfer

  Linked list transfer configuration

- Call the function HAL_DMA_SetConfigLinkedListXfer() to configure the DMA channel linked list transfer according to
  configured parameter within hal_dma_linkedlist_xfer_config_t structure

- Call the function HAL_DMA_GetConfigLinkedListXfer() to get the current configured linked list transfer

  Event mode transfer configuration

- Call the function HAL_DMA_SetLinkedListXferEventMode() to configure the DMA channel event mode according to
  selected parameter within hal_dma_linkedlist_xfer_event_mode_t enumeration

- Call the function HAL_DMA_ResetLinkedListXferEventMode() to reset the DMA channel event mode configuration

