MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.c
- Call the function HAL_DMA_GetLinkedListXferEventMode() to get the current configured event mode

  Priority transfer configuration

- Call the function HAL_DMA_SetLinkedListXferPriority() to configure the DMA channel priority according to selected
  parameter within hal_dma_priority_t enumeration

- Call the function HAL_DMA_ResetLinkedListXferPriority() to reset the DMA channel priority configuration

- Call the function HAL_DMA_GetLinkedListXferPriority() to get the current configured priority

  Execution mode transfer configuration

- Call the function HAL_DMA_SetLinkedListXferExecutionMode() to configure the DMA channel execution mode according to
  selected parameter within hal_dma_linkedlist_execution_mode_t enumeration

- Call the function HAL_DMA_ResetLinkedListXferExecutionMode() to reset the DMA channel execution mode configuration

- Call the function HAL_DMA_GetLinkedListXferExecutionMode() to get the current configured execution mode

  Peripherals linked list circular transfer configuration

- Call the function HAL_DMA_SetConfigPeriphLinkedListCircularXfer() to configure the DMA channel peripheral linked list
  circular transfer according to configured parameter within hal_dma_direct_xfer_config_t structure

- Call the function HAL_DMA_GetConfigPeriphLinkedListCircularXfer() to get the current configured peripheral linked list
  circular transfer
  */

/**
  * @brief  Set the DMA channel direct transfer configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @param  p_config          Pointer to @ref hal_dma_direct_xfer_config_t configuration structure
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_config pointer is NULL
  * @retval HAL_OK            Direct transfer is successfully configured
  */
hal_status_t HAL_DMA_SetConfigDirectXfer(hal_dma_handle_t *hdma, const hal_dma_direct_xfer_config_t *p_config)
{
  ASSERT_DBG_PARAM(hdma     != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_DMA_REQUEST((uint32_t)p_config->request));
  ASSERT_DBG_PARAM(IS_DMA_DIRECTION((uint32_t)p_config->direction));
  ASSERT_DBG_PARAM(IS_DMA_SRC_INC((uint32_t)p_config->src_inc));
  ASSERT_DBG_PARAM(IS_DMA_DEST_INC((uint32_t)p_config->dest_inc));
  ASSERT_DBG_PARAM(IS_DMA_SRC_DATA_WIDTH((uint32_t)p_config->src_data_width));
  ASSERT_DBG_PARAM(IS_DMA_DEST_DATA_WIDTH((uint32_t)p_config->dest_data_width));
  ASSERT_DBG_PARAM(IS_DMA_PRIORITY((uint32_t)p_config->priority));
  ASSERT_DBG_STATE(hdma->global_state, (uint32_t)HAL_DMA_STATE_INIT | (uint32_t)HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  DMA_SetConfigDirectXfer(hdma, p_config);

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  hdma->xfer_mode = HAL_DMA_XFER_MODE_DIRECT;
#endif /* USE_HAL_DMA_LINKEDLIST */

  hdma->global_state = HAL_DMA_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief Get the DMA channel direct transfer configuration.
  * @param hdma     Pointer to DMA channel handle
  * @param p_config Pointer to @ref hal_dma_direct_xfer_config_t configuration structure
  */
void HAL_DMA_GetConfigDirectXfer(hal_dma_handle_t *hdma, hal_dma_direct_xfer_config_t *p_config)
{
  ASSERT_DBG_PARAM(hdma     != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

  DMA_GetConfigDirectXfer(hdma, p_config);
}

/**
  * @brief  Set the DMA channel direct transfer hardware request mode configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @param  hw_request_mode   Element in @ref hal_dma_hardware_request_mode_t  enumeration
  * @retval HAL_INVALID_PARAM Invalid parameter return when transfer mode parameter is not direct
  * @retval HAL_OK            Request mode is successfully configured
  */
hal_status_t HAL_DMA_SetConfigDirectXferHardwareRequestMode(hal_dma_handle_t *hdma,
                                                            hal_dma_hardware_request_mode_t  hw_request_mode)
{
  ASSERT_DBG_PARAM(hdma     != NULL);
  ASSERT_DBG_PARAM(IS_DMA_HARDWARE_REQUEST_MODE((uint32_t)hw_request_mode));
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma->xfer_mode != HAL_DMA_XFER_MODE_DIRECT)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
#endif /* USE_HAL_DMA_LINKEDLIST */

  LL_DMA_SetHWRequestMode(DMA_CHANNEL_GET_INSTANCE(hdma), (uint32_t)hw_request_mode);

  return HAL_OK;
}

/**
  * @brief  Reset the DMA channel direct transfer hardware request mode configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @retval HAL_INVALID_PARAM Invalid parameter return when transfer mode parameter is not direct
  * @retval HAL_OK            Reset direct transfer request mode configuration is successful
  */
hal_status_t HAL_DMA_ResetConfigDirectXferHardwareRequestMode(hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma->xfer_mode != HAL_DMA_XFER_MODE_DIRECT)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
#endif /* USE_HAL_DMA_LINKEDLIST */

  LL_DMA_SetHWRequestMode(DMA_CHANNEL_GET_INSTANCE(hdma), (uint32_t)HAL_DMA_HARDWARE_REQUEST_BURST);

  return HAL_OK;
}

/**
  * @brief Get the DMA channel direct transfer hardware request mode configuration.
  * @param hdma     Pointer to DMA channel handle
  * @retval Returned value can be one of the following values:
  *         @arg @ref HAL_DMA_HARDWARE_REQUEST_BURST
  *         @arg @ref HAL_DMA_HARDWARE_REQUEST_BLOCK
  */
hal_dma_hardware_request_mode_t  HAL_DMA_GetConfigDirectXferHardwareRequestMode(hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

  return ((hal_dma_hardware_request_mode_t)LL_DMA_GetHWRequestType(DMA_CHANNEL_GET_INSTANCE(hdma)));
}

/**
  * @brief  Set the DMA channel direct transfer flow control mode configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @param  flow_control_mode Element in @ref hal_dma_flow_control_mode_t enumeration
  * @retval HAL_OK            Direct transfer flow control mode is successfully configured
  */
hal_status_t HAL_DMA_SetConfigDirectXferFlowControlMode(hal_dma_handle_t *hdma,
                                                        hal_dma_flow_control_mode_t flow_control_mode)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(IS_DMA_PFREQ_INSTANCE((DMA_Channel_TypeDef *)((uint32_t)hdma->instance)));
  ASSERT_DBG_PARAM(IS_DMA_FLOW_CONTROL_MODE((uint32_t)flow_control_mode));
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

  LL_DMA_SetFlowControlMode(DMA_CHANNEL_GET_INSTANCE(hdma), (uint32_t)flow_control_mode);

  return HAL_OK;
}

/**
  * @brief  Reset the DMA channel direct transfer flow control mode configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @retval HAL_OK            Direct transfer flow control mode is successfully configured
  */
hal_status_t HAL_DMA_ResetConfigDirectXferFlowControlMode(hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(IS_DMA_PFREQ_INSTANCE((DMA_Channel_TypeDef *)((uint32_t)hdma->instance)));
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

  LL_DMA_SetFlowControlMode(DMA_CHANNEL_GET_INSTANCE(hdma), (uint32_t)HAL_DMA_FLOW_CONTROL_DMA);

  return HAL_OK;
}

/**
  * @brief  Get the DMA channel direct transfer flow control mode configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @retval Returned value can be one of the following values:
  *         @arg @ref HAL_DMA_FLOW_CONTROL_DMA
  *         @arg @ref HAL_DMA_FLOW_CONTROL_PERIPH
  */
hal_dma_flow_control_mode_t HAL_DMA_GetConfigDirectXferFlowControlMode(hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(IS_DMA_PFREQ_INSTANCE((DMA_Channel_TypeDef *)((uint32_t)hdma->instance)));
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

  return ((hal_dma_flow_control_mode_t)LL_DMA_GetFlowControlMode(DMA_CHANNEL_GET_INSTANCE(hdma)));
}

/**
  * @brief  Set the DMA channel direct transfer trigger configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @param  p_config          Pointer to @ref hal_dma_trigger_config_t configuration structure
  * @retval HAL_INVALID_PARAM Invalid parameter return when transfer mode parameter is not direct or p_config pointer is
  *                           NULL
  * @retval HAL_OK            Direct transfer trigger is successfully configured
  */
hal_status_t HAL_DMA_SetConfigDirectXferTrigger(hal_dma_handle_t *hdma, const hal_dma_trigger_config_t *p_config)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_DMA_TRIGGER_SOURCE((uint32_t)p_config->source));
  ASSERT_DBG_PARAM(IS_DMA_TRIGGER_POLARITY((uint32_t)p_config->polarity));
  ASSERT_DBG_PARAM(IS_DMA_TRIGGER_MODE((uint32_t)p_config->mode));
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (hdma->xfer_mode != HAL_DMA_XFER_MODE_DIRECT)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_DMA_LINKEDLIST */
#endif /* USE_HAL_CHECK_PARAM */

