MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.c
  LL_DMA_ConfigChannelTrigger(DMA_CHANNEL_GET_INSTANCE(hdma), (uint32_t)p_config->source,
                              ((uint32_t)p_config->mode | (uint32_t)p_config->polarity));

  return HAL_OK;
}

/**
  * @brief Reset the DMA channel direct transfer trigger configuration.
  * @param hdma               Pointer to DMA channel handle
  * @retval HAL_INVALID_PARAM Invalid parameter return when transfer mode parameter is not direct
  * @retval HAL_OK            Reset direct transfer trigger configuration is successful
  */
hal_status_t HAL_DMA_ResetConfigDirectXferTrigger(hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma->xfer_mode != HAL_DMA_XFER_MODE_DIRECT)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
#endif /* USE_HAL_DMA_LINKEDLIST */

  LL_DMA_ConfigChannelTrigger(DMA_CHANNEL_GET_INSTANCE(hdma), (uint32_t)HAL_LPDMA1_TRIGGER_EXTI0,
                              ((uint32_t)HAL_DMA_TRIGGER_BLOCK_TRANSFER | (uint32_t)HAL_DMA_TRIGGER_POLARITY_MASKED));

  return HAL_OK;
}

/**
  * @brief Get the DMA channel direct transfer trigger configuration.
  * @param hdma     Pointer to DMA channel handle
  * @param p_config Pointer to @ref hal_dma_trigger_config_t configuration structure
  */
void HAL_DMA_GetConfigDirectXferTrigger(hal_dma_handle_t *hdma, hal_dma_trigger_config_t *p_config)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

  p_config->mode     = (hal_dma_trigger_mode_t)LL_DMA_GetTriggerMode(DMA_CHANNEL_GET_INSTANCE(hdma));
  p_config->polarity = (hal_dma_trigger_polarity_t)LL_DMA_GetTriggerPolarity(DMA_CHANNEL_GET_INSTANCE(hdma));
  p_config->source   = (hal_dma_trigger_source_t)LL_DMA_GetHWTrigger(DMA_CHANNEL_GET_INSTANCE(hdma));
}

/**
  * @brief  Set the DMA channel direct transfer data handling configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @param  p_config          Pointer to @ref hal_dma_data_handling_config_t configuration structure
  * @retval HAL_INVALID_PARAM Invalid parameter return when transfer mode parameter is not direct or p_config pointer is
  *                           NULL
  * @retval HAL_OK            Direct transfer data handling is successfully configured
  */
hal_status_t HAL_DMA_SetConfigDirectXferDataHandling(hal_dma_handle_t *hdma,
                                                     const hal_dma_data_handling_config_t *p_config)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_DMA_DEST_DATA_TRUNC_PADD((uint32_t)p_config->trunc_padd));
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (hdma->xfer_mode != HAL_DMA_XFER_MODE_DIRECT)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_DMA_LINKEDLIST */
#endif /* USE_HAL_CHECK_PARAM */

  LL_DMA_ConfigDataHandling(DMA_CHANNEL_GET_INSTANCE(hdma),
                            (uint32_t)p_config->trunc_padd);
  return HAL_OK;
}

/**
  * @brief  Reset the DMA channel direct transfer data handling configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @retval HAL_INVALID_PARAM Invalid parameter return when transfer mode parameter is not direct
  * @retval HAL_OK            Reset direct transfer data handling configuration is successful
  */
hal_status_t HAL_DMA_ResetConfigDirectXferDataHandling(hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma->xfer_mode != HAL_DMA_XFER_MODE_DIRECT)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
#endif /* USE_HAL_DMA_LINKEDLIST */

  /* Reset DMA channel data handling configuration */
  LL_DMA_ConfigDataHandling(DMA_CHANNEL_GET_INSTANCE(hdma),
                            (uint32_t)HAL_DMA_DEST_DATA_TRUNC_LEFT_PADD_ZERO);

  return HAL_OK;
}

/**
  * @brief Get the DMA channel direct transfer data handling configuration.
  * @param hdma     Pointer to DMA channel handle
  * @param p_config Pointer to @ref hal_dma_data_handling_config_t configuration structure
  */
void HAL_DMA_GetConfigDirectXferDataHandling(hal_dma_handle_t *hdma, hal_dma_data_handling_config_t *p_config)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

  p_config->trunc_padd             =
    (hal_dma_dest_data_trunc_padd_t)LL_DMA_GetDataTruncPadd(DMA_CHANNEL_GET_INSTANCE(hdma));
}

/**
  * @brief Set the DMA channel privileged access level attribute.
  * @param instance     DMA channel instance
  * @param priv_attr    Element in @ref hal_dma_priv_attr_t enumeration
  * @retval HAL_ERROR   Operation failed, not in privileged execution mode.
  * @retval HAL_OK      Privileged attribute set successfully.
  */
hal_status_t HAL_DMA_SetPrivAttr(hal_dma_channel_t instance, hal_dma_priv_attr_t priv_attr)
{
  ASSERT_DBG_PARAM(IS_DMA_ALL_INSTANCE((DMA_Channel_TypeDef *)((uint32_t)instance)));
  ASSERT_DBG_PARAM(IS_DMA_PRIV_ATTR(priv_attr));

  if (STM32_IS_PRIVILEGED_EXECUTION() == 0U)
  {
    return HAL_ERROR;
  }

  LL_DMA_SetPrivAttr(LL_DMA_GET_INSTANCE(instance), LL_DMA_GET_CHANNEL_IDX(instance), (uint32_t)priv_attr);

  return HAL_OK;
}

/**
  * @brief Get the DMA channel privileged access attribute configuration.
  * @param instance        DMA channel instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref HAL_DMA_PRIV
  *         @arg @ref HAL_DMA_NPRIV
  */
hal_dma_priv_attr_t HAL_DMA_GetPrivAttr(hal_dma_channel_t instance)
{
  ASSERT_DBG_PARAM(IS_DMA_ALL_INSTANCE((DMA_Channel_TypeDef *)((uint32_t)instance)));

  return (hal_dma_priv_attr_t)LL_DMA_GetPrivAttr(LL_DMA_GET_INSTANCE(instance),
                                                 LL_DMA_GET_CHANNEL_IDX(instance));
}


/**
  * @brief  Lock the privileged access levels attribute for item(s).
  * @param instance     DMA channel instance
  * @retval HAL_ERROR   Operation failed, not in privileged execution mode.
  * @retval HAL_OK      Privilege attribute locked successfully
  */
hal_status_t HAL_DMA_LockAttr(hal_dma_channel_t instance)
{
  ASSERT_DBG_PARAM(IS_DMA_ALL_INSTANCE((DMA_Channel_TypeDef *)((uint32_t)instance)));

  if (STM32_IS_PRIVILEGED_EXECUTION() == 0U)
  {
    return HAL_ERROR;
  }

  LL_DMA_LockAttr(LL_DMA_GET_INSTANCE(instance), LL_DMA_GET_CHANNEL_IDX(instance));

  return HAL_OK;
}


/**
  * @brief  Check if the DMA channel privilege attribute is locked.
  * @param instance       DMA channel instance
  * @retval Privilege attribute lock status, element in @ref hal_dma_attr_lock_status_t enumeration
  */
hal_dma_attr_lock_status_t HAL_DMA_IsLockedAttr(hal_dma_channel_t instance)
{
  ASSERT_DBG_PARAM(IS_DMA_ALL_INSTANCE((DMA_Channel_TypeDef *)((uint32_t)instance)));

  return (hal_dma_attr_lock_status_t)LL_DMA_IsLockedAttr(LL_DMA_GET_INSTANCE(instance),
                                                         LL_DMA_GET_CHANNEL_IDX(instance));
}

/**
  * @brief  Set the DMA channel peripheral direct transfer configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @param  p_config          Pointer to @ref hal_dma_direct_xfer_config_t configuration structure
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_config pointer is NULL
  * @retval HAL_OK            Peripheral direct transfer is successfully configured
  */
hal_status_t HAL_DMA_SetConfigPeriphDirectXfer(hal_dma_handle_t *hdma, const hal_dma_direct_xfer_config_t *p_config)
{
  ASSERT_DBG_PARAM(hdma     != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_DMA_REQUEST((uint32_t)p_config->request));
  ASSERT_DBG_PARAM(IS_DMA_DIRECTION((uint32_t)p_config->direction));
  ASSERT_DBG_PARAM(IS_DMA_SRC_INC((uint32_t)p_config->src_inc));
  ASSERT_DBG_PARAM(IS_DMA_DEST_INC((uint32_t)p_config->dest_inc));
  ASSERT_DBG_PARAM(IS_DMA_SRC_DATA_WIDTH((uint32_t)p_config->src_data_width));
  ASSERT_DBG_PARAM(IS_DMA_DEST_DATA_WIDTH((uint32_t)p_config->dest_data_width));
  ASSERT_DBG_PARAM(IS_DMA_PRIORITY((uint32_t)p_config->priority));
  ASSERT_DBG_STATE(hdma->global_state, (uint32_t)HAL_DMA_STATE_INIT | (uint32_t)HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

