MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.c
  DMA_SetConfigDirectXfer(hdma, p_config);

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  hdma->xfer_mode = HAL_DMA_XFER_MODE_DIRECT;
#endif /* USE_HAL_DMA_LINKEDLIST */

  hdma->global_state = HAL_DMA_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief Get the DMA channel peripheral direct transfer configuration.
  * @param hdma     Pointer to DMA channel handle
  * @param p_config Pointer to @ref hal_dma_direct_xfer_config_t configuration structure
  */
void HAL_DMA_GetConfigPeriphDirectXfer(hal_dma_handle_t *hdma, hal_dma_direct_xfer_config_t *p_config)
{
  ASSERT_DBG_PARAM(hdma     != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

  DMA_GetConfigDirectXfer(hdma, p_config);
}

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
/**
  * @brief  Set the DMA channel linked list transfer configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @param  p_config          Pointer to @ref hal_dma_linkedlist_xfer_config_t configuration structure
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_config pointer is NULL
  * @retval HAL_OK            Linked list transfer is successfully configured
  */
hal_status_t HAL_DMA_SetConfigLinkedListXfer(hal_dma_handle_t *hdma,
                                             const hal_dma_linkedlist_xfer_config_t *p_config)
{
  ASSERT_DBG_PARAM(hdma     != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_DMA_PRIORITY((uint32_t)p_config->priority));
  ASSERT_DBG_PARAM(IS_DMA_LINKEDLIST_XFER_EVENT_MODE((uint32_t)p_config->xfer_event_mode));
  ASSERT_DBG_STATE(hdma->global_state, (uint32_t)HAL_DMA_STATE_INIT | (uint32_t)HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1U)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  DMA_SetConfigLinkedListXfer(hdma, p_config);

  hdma->xfer_mode = HAL_DMA_XFER_MODE_LINKEDLIST_LINEAR;

  hdma->global_state = HAL_DMA_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief Get the DMA channel linked list transfer configuration.
  * @param hdma     Pointer to DMA channel handle
  * @param p_config Pointer to @ref hal_dma_linkedlist_xfer_config_t configuration structure
  */
void HAL_DMA_GetConfigLinkedListXfer(hal_dma_handle_t *hdma, hal_dma_linkedlist_xfer_config_t *p_config)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

  DMA_GetConfigLinkedListXfer(hdma, p_config);
}

/**
  * @brief  Set the DMA channel linked list transfer event mode configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @param  xfer_event_mode   Element in @ref hal_dma_linkedlist_xfer_event_mode_t enumeration
  * @retval HAL_INVALID_PARAM Invalid parameter return when transfer mode parameter is direct
  * @retval HAL_OK            Linked list transfer event mode is successfully configured
  */
hal_status_t HAL_DMA_SetLinkedListXferEventMode(hal_dma_handle_t *hdma,
                                                hal_dma_linkedlist_xfer_event_mode_t xfer_event_mode)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(IS_DMA_LINKEDLIST_XFER_EVENT_MODE((uint32_t)xfer_event_mode));
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma->xfer_mode == HAL_DMA_XFER_MODE_DIRECT)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  LL_DMA_SetTransferEventMode(DMA_CHANNEL_GET_INSTANCE(hdma), (uint32_t)xfer_event_mode);

  return HAL_OK;
}

/**
  * @brief  Reset the DMA channel linked list transfer event mode configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @retval HAL_INVALID_PARAM Invalid parameter return when transfer mode parameter is direct
  * @retval HAL_OK            Reset linked list transfer event mode configuration is successful
  */
hal_status_t HAL_DMA_ResetLinkedListXferEventMode(hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma->xfer_mode == HAL_DMA_XFER_MODE_DIRECT)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  LL_DMA_SetTransferEventMode(DMA_CHANNEL_GET_INSTANCE(hdma), (uint32_t)HAL_DMA_LINKEDLIST_XFER_EVENT_BLOCK);

  return HAL_OK;
}

/**
  * @brief  Get the DMA channel linked list transfer event mode configuration.
  * @param  hdma                                         Pointer to DMA channel handle
  * @retval HAL_DMA_LINKEDLIST_XFER_EVENT_BLOCK          Linked list transfer event block
  * @retval HAL_DMA_LINKEDLIST_XFER_EVENT_REPEATED_BLOCK Linked list transfer event repeated block
  * @retval HAL_DMA_LINKEDLIST_XFER_EVENT_NODE           Linked list transfer event node
  * @retval HAL_DMA_LINKEDLIST_XFER_EVENT_Q              Linked list transfer event Q
  */
hal_dma_linkedlist_xfer_event_mode_t HAL_DMA_GetLinkedListXferEventMode(hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

  return ((hal_dma_linkedlist_xfer_event_mode_t)LL_DMA_GetTransferEventMode(DMA_CHANNEL_GET_INSTANCE(hdma)));
}

/**
  * @brief  Set the DMA channel linked list transfer priority configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @param  priority          Element in @ref hal_dma_priority_t enumeration
  * @retval HAL_INVALID_PARAM Invalid parameter return when transfer mode parameter is direct
  * @retval HAL_OK            Linked list transfer priority is successfully configured
  */
hal_status_t HAL_DMA_SetLinkedListXferPriority(hal_dma_handle_t *hdma, hal_dma_priority_t priority)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(IS_DMA_PRIORITY((uint32_t)priority));
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma->xfer_mode == HAL_DMA_XFER_MODE_DIRECT)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  LL_DMA_SetChannelPriorityLevel(DMA_CHANNEL_GET_INSTANCE(hdma), (uint32_t)priority);

  return HAL_OK;
}

/**
  * @brief  Reset the DMA channel linked list transfer priority configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @retval HAL_INVALID_PARAM Invalid parameter return when transfer mode parameter is direct
  * @retval HAL_OK            Reset linked list transfer priority configuration is successful
  */
hal_status_t HAL_DMA_ResetLinkedListXferPriority(hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma->xfer_mode == HAL_DMA_XFER_MODE_DIRECT)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  LL_DMA_SetChannelPriorityLevel(DMA_CHANNEL_GET_INSTANCE(hdma), (uint32_t)HAL_DMA_PRIORITY_LOW_WEIGHT_LOW);

  return HAL_OK;
}

/**
  * @brief  Get the DMA channel linked list transfer priority configuration.
  * @param  hdma                             Pointer to DMA channel handle
  * @retval HAL_DMA_PRIORITY_LOW_WEIGHT_LOW  DMA channel priority low and weight low
  * @retval HAL_DMA_PRIORITY_LOW_WEIGHT_MID  DMA channel priority low and weight mid
  * @retval HAL_DMA_PRIORITY_LOW_WEIGHT_HIGH DMA channel priority low and weight high
  * @retval HAL_DMA_PRIORITY_HIGH            DMA channel priority high
  */
hal_dma_priority_t HAL_DMA_GetLinkedListXferPriority(hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

  return ((hal_dma_priority_t)LL_DMA_GetChannelPriorityLevel(DMA_CHANNEL_GET_INSTANCE(hdma)));
}

/**
  * @brief  Set the DMA channel linked list transfer execution mode configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @param  exec_mode         Element in @ref hal_dma_linkedlist_execution_mode_t enumeration
  * @retval HAL_INVALID_PARAM Invalid parameter return when transfer mode parameter is direct
  * @retval HAL_OK            Linked list transfer execution mode is successfully configured
  */
hal_status_t HAL_DMA_SetLinkedListXferExecutionMode(hal_dma_handle_t *hdma,
                                                    hal_dma_linkedlist_execution_mode_t exec_mode)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(IS_DMA_LINKEDLIST_EXEC_MODE((uint32_t)exec_mode));
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma->xfer_mode == HAL_DMA_XFER_MODE_DIRECT)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  LL_DMA_SetLinkStepMode(DMA_CHANNEL_GET_INSTANCE(hdma), (uint32_t)exec_mode);

  return HAL_OK;
}

/**
  * @brief  Reset the DMA channel linked list transfer execution mode configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @retval HAL_INVALID_PARAM Invalid parameter return when transfer mode parameter is direct
  * @retval HAL_OK            Reset linked list transfer execution mode configuration is successful
  */
hal_status_t HAL_DMA_ResetLinkedListXferExecutionMode(hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma->xfer_mode == HAL_DMA_XFER_MODE_DIRECT)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

