MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.c
  LL_DMA_SetLinkStepMode(DMA_CHANNEL_GET_INSTANCE(hdma), (uint32_t)HAL_DMA_LINKEDLIST_EXECUTION_Q);

  return HAL_OK;
}

/**
  * @brief  Get the DMA channel linked list transfer execution mode configuration.
  * @param  hdma                              Pointer to DMA channel handle
  * @retval HAL_DMA_LINKEDLIST_EXECUTION_Q    DMA channel is executed for the full linked list
  * @retval HAL_DMA_LINKEDLIST_NODE_EXECUTION DMA channel is executed once for the current linked list
  */
hal_dma_linkedlist_execution_mode_t HAL_DMA_GetLinkedListXferExecutionMode(hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

  return ((hal_dma_linkedlist_execution_mode_t)LL_DMA_GetLinkStepMode(DMA_CHANNEL_GET_INSTANCE(hdma)));
}

/**
  * @brief  Set the DMA channel peripheral linked list circular transfer configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @param  p_node            Pointer to @ref hal_dma_node_t structure
  * @param  p_node_config     Pointer to @ref hal_dma_direct_xfer_config_t structure
  * @retval HAL_INVALID_PARAM Invalid parameter return when node or node_config pointer is NULL
  * @retval HAL_OK            Peripheral linked list circular transfer is successfully configured
  */
hal_status_t HAL_DMA_SetConfigPeriphLinkedListCircularXfer(hal_dma_handle_t *hdma, hal_dma_node_t *p_node,
                                                           const hal_dma_direct_xfer_config_t *p_node_config)
{
  hal_dma_node_type_t              node_type;
  hal_dma_linkedlist_xfer_config_t p_config;

  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(p_node != NULL);
  ASSERT_DBG_PARAM(p_node_config != NULL);
  ASSERT_DBG_PARAM(IS_DMA_REQUEST((uint32_t)p_node_config->request));
  ASSERT_DBG_PARAM(IS_DMA_DIRECTION((uint32_t)p_node_config->direction));
  ASSERT_DBG_PARAM(IS_DMA_SRC_INC((uint32_t)p_node_config->src_inc));
  ASSERT_DBG_PARAM(IS_DMA_DEST_INC((uint32_t)p_node_config->dest_inc));
  ASSERT_DBG_PARAM(IS_DMA_SRC_DATA_WIDTH((uint32_t)p_node_config->src_data_width));
  ASSERT_DBG_PARAM(IS_DMA_DEST_DATA_WIDTH((uint32_t)p_node_config->dest_data_width));
  ASSERT_DBG_PARAM(IS_DMA_PRIORITY((uint32_t)p_node_config->priority));
  ASSERT_DBG_STATE(hdma->global_state, (uint32_t)HAL_DMA_STATE_INIT | (uint32_t)HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_node == NULL) || (p_node_config == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  node_type = DMA_GET_NODE_TYPE(hdma->instance);

  hdma->p_head_node = p_node;

  /* Set DMA channel linked list transfer configuration */
  p_config.priority   = p_node_config->priority;
  p_config.xfer_event_mode = HAL_DMA_LINKEDLIST_XFER_EVENT_Q;
  DMA_SetConfigLinkedListXfer(hdma, &p_config);

  /* Fill linked list node for periph circular transfer */
  DMA_FillNodeDirectXfer(p_node, p_node_config, node_type, HAL_DMA_LINKEDLIST_XFER_EVENT_BLOCK);

  /* Set circular link for DMA node */
  p_node->regs[node_type] = (((uint32_t)p_node & DMA_CLLR_LA) | LL_DMA_UPDATE_ALL);

  hdma->xfer_mode = HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR;

  hdma->global_state = HAL_DMA_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief Get the DMA channel peripheral linked list circular transfer configuration.
  * @param hdma          Pointer to DMA channel handle
  * @param p_node        Pointer to @ref hal_dma_node_t structure
  * @param p_node_config Pointer to @ref hal_dma_direct_xfer_config_t structure
  */
void HAL_DMA_GetConfigPeriphLinkedListCircularXfer(hal_dma_handle_t *hdma, hal_dma_node_t *p_node,
                                                   hal_dma_direct_xfer_config_t *p_node_config)
{
  hal_dma_linkedlist_xfer_config_t p_config;
  hal_dma_node_type_t              node_type;

  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(p_node != NULL);
  ASSERT_DBG_PARAM(p_node_config != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

  node_type = DMA_GET_NODE_TYPE(hdma->instance);

  /* Get the DMA channel configuration in linked list mode */
  DMA_GetConfigLinkedListXfer(hdma, &p_config);

  /* Get the linked list node for direct transfer */
  HAL_DMA_GetNodeDirectXfer(p_node, p_node_config, &node_type);

  /* Get the priority level for the linked list node */
  p_node_config->priority = p_config.priority;
}
#endif /* USE_HAL_DMA_LINKEDLIST */
/**
  * @}
  */

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
/** @addtogroup DMA_Exported_Functions_Group3
  * @{
This subsection provides a set of functions to configure the DMA channel peripheral:

  Node configuration

- Call the function HAL_DMA_FillNodeConfig() to fill the node according to configured parameter within
  hal_dma_node_config_t structure

- Call the function HAL_DMA_GetNodeConfig() to get the current node configuration

  Direct transfer node configuration

- Call the function HAL_DMA_FillNodeDirectXfer() to fill the node direct transfer according to configured parameter
  within hal_dma_direct_xfer_config_t structure

- Call the function HAL_DMA_GetNodeDirectXfer() to get the current node direct transfer configuration

  Hardware request mode node configuration

- Call the function HAL_DMA_FillNodeHardwareRequestMode() to fill the node hardware request mode according to selected
  request mode parameter

- Call the function HAL_DMA_GetNodeHardwareRequestMode() to get the current node hardware request mode selection

  Flow control mode node configuration

- Call the function HAL_DMA_FillNodeFlowControlMode() to fill the node flow control mode according to selected flow
  control mode parameter

- Call the function HAL_DMA_GetNodeFlowControlMode() to get the current node flow control mode selection

  Transfer event mode node configuration

- Call the function HAL_DMA_FillNodeXferEventMode() to fill the node transfer event mode according to selected
  transfer event mode parameter

- Call the function HAL_DMA_GetNodeXferEventMode() to get the current node transfer event mode configuration

  Trigger node configuration

- Call the function HAL_DMA_FillNodeTrigger() to fill the node trigger according to configured trigger parameters

- Call the function HAL_DMA_GetNodeTrigger() to get the current node trigger configuration

  Data handling node configuration

- Call the function HAL_DMA_FillNodeDataHandling() to fill the node data handling according to configured data handling
  parameters

- Call the function HAL_DMA_GetNodeDataHandling() to get the current node data handling configuration

  Data node configuration

- Call the function HAL_DMA_FillNodeData() to fill the node data according to configured data parameters

- Call the function HAL_DMA_GetNodeData() to get the current node data configuration

  Conversion Q nodes

- Call the function HAL_DMA_ConvertQNodesToDynamic() to Convert linked list queue associated to the handle to dynamic
  format

- Call the function HAL_DMA_ConvertQNodesToStatic() to Convert linked list queue associated to the handle to static
  format
  */

/**
  * @brief  Fill node configuration.
  * @param  p_node            Pointer to @ref hal_dma_node_t node structure
  * @param  p_conf            Pointer to @ref hal_dma_node_config_t configuration structure
  * @param  node_type         Element in @ref hal_dma_node_type_t enumeration
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_node or p_conf pointer is NULL
  * @retval HAL_OK            Fill node is successfully configured
  */
hal_status_t HAL_DMA_FillNodeConfig(hal_dma_node_t *p_node, const hal_dma_node_config_t *p_conf,
                                    hal_dma_node_type_t node_type)
{
  ASSERT_DBG_PARAM(p_node != NULL);
  ASSERT_DBG_PARAM(p_conf != NULL);
  ASSERT_DBG_PARAM(IS_DMA_REQUEST((uint32_t)p_conf->xfer.request));
  ASSERT_DBG_PARAM(IS_DMA_DIRECTION((uint32_t)p_conf->xfer.direction));
  ASSERT_DBG_PARAM(IS_DMA_SRC_INC((uint32_t)p_conf->xfer.src_inc));
  ASSERT_DBG_PARAM(IS_DMA_DEST_INC((uint32_t)p_conf->xfer.dest_inc));
  ASSERT_DBG_PARAM(IS_DMA_SRC_DATA_WIDTH((uint32_t)p_conf->xfer.src_data_width));
  ASSERT_DBG_PARAM(IS_DMA_DEST_DATA_WIDTH((uint32_t)p_conf->xfer.dest_data_width));
  ASSERT_DBG_PARAM(IS_DMA_HARDWARE_REQUEST_MODE((uint32_t)p_conf->hw_request_mode));
  ASSERT_DBG_PARAM(IS_DMA_FLOW_CONTROL_MODE((uint32_t)p_conf->flow_ctrl_mode));
  ASSERT_DBG_PARAM(IS_DMA_LINKEDLIST_XFER_EVENT_MODE((uint32_t)p_conf->xfer_event_mode));
  ASSERT_DBG_PARAM(IS_DMA_TRIGGER_SOURCE((uint32_t)p_conf->trigger.source));
  ASSERT_DBG_PARAM(IS_DMA_TRIGGER_POLARITY((uint32_t)p_conf->trigger.polarity));
  ASSERT_DBG_PARAM(IS_DMA_TRIGGER_MODE((uint32_t)p_conf->trigger.mode));
  ASSERT_DBG_PARAM(IS_DMA_DEST_DATA_TRUNC_PADD((uint32_t)p_conf->data_handling.trunc_padd));
  ASSERT_DBG_PARAM(p_conf->size_byte <= 0xFFFFU);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_node == NULL) || (p_conf == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  DMA_FillNodeConfig(p_node, p_conf, node_type);

  return HAL_OK;
}

/**
  * @brief Get the configuration of node.
  * @param p_node      Pointer to @ref hal_dma_node_t node structure
  * @param p_conf      Pointer to @ref hal_dma_node_config_t configuration structure
  * @param p_node_type Element in @ref hal_dma_node_type_t enumeration
  */
void HAL_DMA_GetNodeConfig(const hal_dma_node_t *p_node, hal_dma_node_config_t *p_conf,
                           hal_dma_node_type_t *p_node_type)
{
  ASSERT_DBG_PARAM(p_node != NULL);
  ASSERT_DBG_PARAM(p_conf != NULL);

  DMA_GetConfigNode(p_node, p_conf, p_node_type);
}

/**
  * @brief  Fill node direct transfer configuration.
  * @param  p_node            Pointer to @ref hal_dma_node_t node structure
  * @param  p_config          Pointer to @ref hal_dma_direct_xfer_config_t configuration structure
  * @param  node_type         Element in @ref hal_dma_node_type_t enumeration
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_node or p_config pointer is NULL
  * @retval HAL_OK            Fill node direct transfer is successfully configured
  */
hal_status_t HAL_DMA_FillNodeDirectXfer(hal_dma_node_t *p_node, const hal_dma_direct_xfer_config_t *p_config,
                                        hal_dma_node_type_t node_type)
{
  ASSERT_DBG_PARAM(p_node != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_DMA_REQUEST((uint32_t)p_config->request));
  ASSERT_DBG_PARAM(IS_DMA_DIRECTION((uint32_t)p_config->direction));
  ASSERT_DBG_PARAM(IS_DMA_SRC_INC((uint32_t)p_config->src_inc));
  ASSERT_DBG_PARAM(IS_DMA_DEST_INC((uint32_t)p_config->dest_inc));
  ASSERT_DBG_PARAM(IS_DMA_SRC_DATA_WIDTH((uint32_t)p_config->src_data_width));
  ASSERT_DBG_PARAM(IS_DMA_DEST_DATA_WIDTH((uint32_t)p_config->dest_data_width));
  ASSERT_DBG_PARAM(IS_DMA_PRIORITY((uint32_t)p_config->priority));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_node == NULL) || (p_config == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

