MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.c
  DMA_FillNodeDirectXfer(p_node, p_config, node_type, HAL_DMA_LINKEDLIST_XFER_EVENT_Q);

  return HAL_OK;
}

/**
  * @brief Get the configuration of node direct transfer.
  * @param p_node      Pointer to @ref hal_dma_node_t node structure
  * @param p_config    Pointer to @ref hal_dma_direct_xfer_config_t configuration structure
  * @param p_node_type Element in @ref hal_dma_node_type_t enumeration
  */
void HAL_DMA_GetNodeDirectXfer(const hal_dma_node_t *p_node, hal_dma_direct_xfer_config_t *p_config,
                               hal_dma_node_type_t *p_node_type)
{
  hal_dma_node_config_t p_conf;

  ASSERT_DBG_PARAM(p_node != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

  DMA_GetConfigNode(p_node, &p_conf, p_node_type);

  p_config->request         = p_conf.xfer.request;
  p_config->direction       = p_conf.xfer.direction;
  p_config->src_inc         = p_conf.xfer.src_inc;
  p_config->dest_inc        = p_conf.xfer.dest_inc;
  p_config->src_data_width  = p_conf.xfer.src_data_width;
  p_config->dest_data_width = p_conf.xfer.dest_data_width;
}

/**
  * @brief  Fill node hardware request mode configuration.
  * @param  p_node            Pointer to @ref hal_dma_node_t node structure
  * @param  hw_request_mode   Element in @ref hal_dma_hardware_request_mode_t enumeration
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_node pointer is NULL
  * @retval HAL_OK            Fill node hardware request mode is successfully configured
  */
hal_status_t HAL_DMA_FillNodeHardwareRequestMode(hal_dma_node_t *p_node,
                                                 hal_dma_hardware_request_mode_t hw_request_mode)
{
  ASSERT_DBG_PARAM(p_node != NULL);
  ASSERT_DBG_PARAM(IS_DMA_HARDWARE_REQUEST_MODE((uint32_t)hw_request_mode));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_node == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  STM32_MODIFY_REG(p_node->regs[DMA_NODE_CTR2_REG_OFFSET], DMA_CTR2_BREQ, (uint32_t)hw_request_mode);

  return HAL_OK;
}

/**
  * @brief  Get the configuration of node hardware request mode.
  * @param  p_node                         Pointer to @ref hal_dma_node_t node structure
  * @retval HAL_DMA_HARDWARE_REQUEST_BURST DMA channel hardware request mode is burst
  * @retval HAL_DMA_HARDWARE_REQUEST_BLOCK DMA channel hardware request mode is block
  */
hal_dma_hardware_request_mode_t HAL_DMA_GetNodeHardwareRequestMode(const hal_dma_node_t *p_node)
{
  ASSERT_DBG_PARAM(p_node != NULL);

  return (hal_dma_hardware_request_mode_t)((uint32_t)(p_node->regs[DMA_NODE_CTR2_REG_OFFSET] & DMA_CTR2_BREQ));
}
/**
  * @brief  Fill node flow control mode configuration.
  * @param  p_node            Pointer to @ref hal_dma_node_t node structure
  * @param  flow_control_mode Element in @ref hal_dma_flow_control_mode_t enumeration
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_node pointer is NULL
  * @retval HAL_OK            Fill node flow control request is successfully configured
  */
hal_status_t HAL_DMA_FillNodeFlowControlMode(hal_dma_node_t *p_node, hal_dma_flow_control_mode_t flow_control_mode)
{
  ASSERT_DBG_PARAM(p_node != NULL);
  ASSERT_DBG_PARAM(IS_DMA_FLOW_CONTROL_MODE((uint32_t)flow_control_mode));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_node == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  STM32_MODIFY_REG(p_node->regs[DMA_NODE_CTR2_REG_OFFSET], DMA_CTR2_PFREQ, (uint32_t)flow_control_mode);

  return HAL_OK;
}

/**
  * @brief  Get the configuration of node flow control mode .
  * @param  p_node                      Pointer to @ref hal_dma_node_t node structure
  * @retval HAL_DMA_FLOW_CONTROL_DMA    DMA request DMA channel flow control mode
  * @retval HAL_DMA_FLOW_CONTROL_PERIPH DMA request peripheral flow control mode
  */
hal_dma_flow_control_mode_t HAL_DMA_GetNodeFlowControlMode(const hal_dma_node_t *p_node)
{
  ASSERT_DBG_PARAM(p_node != NULL);

  return (hal_dma_flow_control_mode_t)((uint32_t)(p_node->regs[DMA_NODE_CTR2_REG_OFFSET] & DMA_CTR2_PFREQ));
}

/**
  * @brief  Fill node transfer event mode configuration.
  * @param  p_node            Pointer to @ref hal_dma_node_t node structure
  * @param  xfer_event_mode   Element in @ref hal_dma_linkedlist_xfer_event_mode_t enumeration
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_node is NULL
  * @retval HAL_OK            Fill node transfer event mode is successfully configured
  */
hal_status_t HAL_DMA_FillNodeXferEventMode(hal_dma_node_t *p_node, hal_dma_linkedlist_xfer_event_mode_t xfer_event_mode)
{
  ASSERT_DBG_PARAM(p_node != NULL);
  ASSERT_DBG_PARAM(IS_DMA_LINKEDLIST_XFER_EVENT_MODE((uint32_t)xfer_event_mode));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_node == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  STM32_MODIFY_REG(p_node->regs[DMA_NODE_CTR2_REG_OFFSET], DMA_CTR2_TCEM, (uint32_t)xfer_event_mode);

  return HAL_OK;
}

/**
  * @brief Get the configuration of node transfer event mode.
  * @param p_node  Pointer to @ref hal_dma_node_t node structure
  * @retval HAL_DMA_LINKEDLIST_XFER_EVENT_BLOCK          DMA channel transfer event mode is at block level.
  * @retval HAL_DMA_LINKEDLIST_XFER_EVENT_NODE           DMA channel transfer event mode is at each linked list item.
  * @retval HAL_DMA_LINKEDLIST_XFER_EVENT_Q              DMA channel transfer event mode is at last linked list item.
  */
hal_dma_linkedlist_xfer_event_mode_t HAL_DMA_GetNodeXferEventMode(const hal_dma_node_t *p_node)
{
  ASSERT_DBG_PARAM(p_node != NULL);

  return (hal_dma_linkedlist_xfer_event_mode_t)((uint32_t)(p_node->regs[DMA_NODE_CTR2_REG_OFFSET] & DMA_CTR2_TCEM));
}

/**
  * @brief  Fill node trigger configuration.
  * @param  p_node            Pointer to @ref hal_dma_node_t node structure
  * @param  p_config          Pointer to @ref hal_dma_trigger_config_t configuration structure
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_node or p_config pointer is NULL
  * @retval HAL_OK            Fill node trigger is successfully configured
  */
hal_status_t HAL_DMA_FillNodeTrigger(hal_dma_node_t *p_node, const hal_dma_trigger_config_t *p_config)
{
  ASSERT_DBG_PARAM(p_node != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_DMA_TRIGGER_SOURCE((uint32_t)p_config->source));
  ASSERT_DBG_PARAM(IS_DMA_TRIGGER_POLARITY((uint32_t)p_config->polarity));
  ASSERT_DBG_PARAM(IS_DMA_TRIGGER_MODE((uint32_t)p_config->mode));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_node == NULL) || (p_config == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  STM32_MODIFY_REG(p_node->regs[DMA_NODE_CTR2_REG_OFFSET], (DMA_CTR2_TRIGM | DMA_CTR2_TRIGPOL | DMA_CTR2_TRIGSEL),
                   (uint32_t)p_config->mode | (uint32_t)p_config->polarity |
                   (((uint32_t)p_config->source << DMA_CTR2_TRIGSEL_Pos) & DMA_CTR2_TRIGSEL));

  return HAL_OK;
}

/**
  * @brief Get the configuration of node trigger.
  * @param p_node   Pointer to @ref hal_dma_node_t node structure
  * @param p_config Pointer to @ref hal_dma_trigger_config_t configuration structure
  */
void HAL_DMA_GetNodeTrigger(const hal_dma_node_t *p_node, hal_dma_trigger_config_t *p_config)
{
  uint32_t dummy;

  ASSERT_DBG_PARAM(p_node != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

  dummy = p_node->regs[DMA_NODE_CTR2_REG_OFFSET] & DMA_CTR2_TRIGM;
  p_config->mode     = (hal_dma_trigger_mode_t)dummy;
  dummy = p_node->regs[DMA_NODE_CTR2_REG_OFFSET] & DMA_CTR2_TRIGPOL;
  p_config->polarity = (hal_dma_trigger_polarity_t)dummy;
  dummy = (p_node->regs[DMA_NODE_CTR2_REG_OFFSET] & DMA_CTR2_TRIGSEL) >> DMA_CTR2_TRIGSEL_Pos;
  p_config->source   = (hal_dma_trigger_source_t)dummy;
}

/**
  * @brief  Fill node data handling configuration.
  * @param  p_node            Pointer to @ref hal_dma_node_t node structure
  * @param  p_config          Pointer to @ref hal_dma_data_handling_config_t configuration structure
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_node or p_config pointer is NULL
  * @retval HAL_OK            Fill node data handling is successfully configured
  */
hal_status_t HAL_DMA_FillNodeDataHandling(hal_dma_node_t *p_node, const hal_dma_data_handling_config_t *p_config)
{
  ASSERT_DBG_PARAM(p_node != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_DMA_DEST_DATA_TRUNC_PADD((uint32_t)p_config->trunc_padd));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_node == NULL) || (p_config == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

