MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.c
  STM32_MODIFY_REG(p_node->regs[DMA_NODE_CTR1_REG_OFFSET],
                   DMA_CTR1_PAM,
                   (uint32_t)p_config->trunc_padd);

  return HAL_OK;
}

/**
  * @brief Get the configuration of node data handling.
  * @param p_node   Pointer to @ref hal_dma_node_t node structure
  * @param p_config Pointer to @ref hal_dma_data_handling_config_t configuration structure
  */
void HAL_DMA_GetNodeDataHandling(const hal_dma_node_t *p_node, hal_dma_data_handling_config_t *p_config)
{
  uint32_t dummy;

  ASSERT_DBG_PARAM(p_node != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

  dummy = p_node->regs[DMA_NODE_CTR1_REG_OFFSET] & DMA_CTR1_PAM_0;
  p_config->trunc_padd = (hal_dma_dest_data_trunc_padd_t)dummy;
}

/**
  * @brief  Fill node data configuration.
  * @param  p_node            Pointer to @ref hal_dma_node_t node structure
  * @param  src_addr          Source address
  * @param  dest_addr         Destination address
  * @param  size_byte         Size in byte
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_node pointer is NULL
  * @retval HAL_OK            Fill node data is successfully configured
  */
hal_status_t HAL_DMA_FillNodeData(hal_dma_node_t *p_node, uint32_t src_addr, uint32_t dest_addr, uint32_t size_byte)
{
  ASSERT_DBG_PARAM(p_node != NULL);
  ASSERT_DBG_PARAM((size_byte > 0U) && (size_byte <= 0xFFFFU));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_node == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  DMA_UpdateDataNode(p_node, src_addr, dest_addr, size_byte);

  return HAL_OK;
}

/**
  * @brief Get the configuration of node data.
  * @param p_node      Pointer to @ref hal_dma_node_t node structure
  * @param p_src_addr  Source address
  * @param p_dest_addr Destination address
  * @param p_size_byte Size in byte
  */
void HAL_DMA_GetNodeData(const hal_dma_node_t *p_node, uint32_t *p_src_addr, uint32_t *p_dest_addr,
                         uint32_t *p_size_byte)
{
  uint32_t *dummy;

  ASSERT_DBG_PARAM(p_node != NULL);
  ASSERT_DBG_PARAM(p_src_addr != NULL);
  ASSERT_DBG_PARAM(p_dest_addr != NULL);
  ASSERT_DBG_PARAM(p_size_byte != NULL);

  *p_size_byte = p_node->regs[DMA_NODE_CBR1_REG_OFFSET] & DMA_CBR1_BNDT;
  dummy  = p_src_addr;
  *dummy = p_node->regs[DMA_NODE_CSAR_REG_OFFSET];
  dummy  = p_dest_addr;
  *dummy = p_node->regs[DMA_NODE_CDAR_REG_OFFSET];
}

/**
  * @brief  Convert linked list queue associated to the handle to dynamic format.
  * @param  p_q               Pointer to hal_q_t configuration structure
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_q pointer is NULL
  * @retval HAL_OK            Q nodes to dynamic conversion is successfully configured
  */
hal_status_t HAL_DMA_ConvertQNodesToDynamic(hal_q_t *p_q)
{
  ASSERT_DBG_PARAM(p_q != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_q == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  DMA_ConvertQNodesToDynamic(p_q);

  return HAL_OK;
}

/**
  * @brief  Convert linked list queue associated to the handle to static format.
  * @param  p_q               Pointer to hal_q_t configuration structure
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_q pointer is NULL
  * @retval HAL_OK            Q nodes to static conversion is successfully configured
  */
hal_status_t HAL_DMA_ConvertQNodesToStatic(hal_q_t *p_q)
{
  ASSERT_DBG_PARAM(p_q != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_q == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  DMA_ConvertQNodesToStatic(p_q);

  return HAL_OK;
}
/**
  * @}
  */
#endif /* USE_HAL_DMA_LINKEDLIST */

/** @addtogroup DMA_Exported_Functions_Group4
  * @{

This subsection provides a set of functions to configure the DMA channel peripheral:

- Call the function HAL_DMA_StartDirectXfer() to start direct DMA channel transfer in silent mode

- Call the function HAL_DMA_StartDirectXfer_IT() to start direct DMA channel transfer in interrupt mode
  with default optional interrupts configuration

- Call the function HAL_DMA_StartDirectXfer_IT_Opt() to start direct DMA channel transfer in interrupt mode
  with customized optional interrupts configuration

- Call the HAL_DMA_StartPeriphXfer_IT_Opt() function to start the DMA channel peripheral transfer with filtering
  optional interrupts.\n
  Note: This function is intended exclusively for internal use by HAL PPP drivers for transfers over DMA.

- Call the function HAL_DMA_StartLinkedListXfer() to start linked list DMA channel transfer in silent mode

- Call the function HAL_DMA_StartLinkedListXfer_IT() to start linked list DMA channel transfer in interrupt mode
  with default optional interrupts configuration

- Call the function HAL_DMA_StartLinkedListXfer_IT_Opt() to start linked list DMA channel transfer in interrupt mode
  with customized optional interrupts configuration

- Call the function HAL_DMA_Abort() to abort any ongoing DMA channel transfer in blocking mode

- Call the function HAL_DMA_Abort_IT() to abort any ongoing DMA channel transfer in interrupt mode

- Call the function HAL_DMA_Suspend() to suspend any ongoing DMA channel transfer in blocking mode

- Call the function HAL_DMA_Suspend_IT() to suspend any ongoing DMA channel transfer in interrupt mode

- Call the function HAL_DMA_Resume() to resume any suspended DMA channel transfer immediately.

- Call the function HAL_DMA_PollForXfer() to poll on any finite DMA channel transfer level selected through
  hal_dma_xfer_level_t

- Call the function HAL_DMA_IRQHandler() to handle any DMA channel interrupt. This API must be executed in handler mode
  */

/**
  * @brief  Start the DMA channel direct transfer in silent mode.
  * @param  hdma              Pointer to DMA channel handle
  * @param  src_addr          Source address
  * @param  dest_addr         Destination address
  * @param  size_byte         Size in byte
  * @retval HAL_INVALID_PARAM Invalid parameter return when transfer mode parameter is not direct
  * @retval HAL_BUSY          DMA channel state is active when calling this API
  * @retval HAL_OK            Silent direct transfer is successfully started
  */
hal_status_t HAL_DMA_StartDirectXfer(hal_dma_handle_t *hdma, uint32_t src_addr, uint32_t dest_addr, uint32_t size_byte)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM((size_byte > 0U) && (size_byte <= 0xFFFFU));
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma->xfer_mode != HAL_DMA_XFER_MODE_DIRECT)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
#endif /* USE_HAL_DMA_LINKEDLIST */

