MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.c
  HAL_CHECK_UPDATE_STATE(hdma, global_state, HAL_DMA_STATE_IDLE, HAL_DMA_STATE_ACTIVE);

#if defined (USE_HAL_DMA_GET_LAST_ERRORS) && (USE_HAL_DMA_GET_LAST_ERRORS == 1)
  hdma->last_error_codes = HAL_DMA_ERROR_NONE;
#endif /* USE_HAL_DMA_GET_LAST_ERRORS */

  DMA_StartDirectXfer(hdma, src_addr, dest_addr, size_byte, HAL_DMA_OPT_IT_SILENT);

  return HAL_OK;
}

/**
  * @brief  Start the DMA channel direct transfer in interrupt mode with default optional interrupts configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @param  src_addr          Source address
  * @param  dest_addr         Destination address
  * @param  size_byte         Size in byte
  * @retval HAL_INVALID_PARAM Invalid parameter return when transfer mode parameter is not direct
  * @retval HAL_BUSY          DMA channel state is active when calling this API
  * @retval HAL_OK            Interrupt direct transfer is successfully started
  */
hal_status_t HAL_DMA_StartDirectXfer_IT(hal_dma_handle_t *hdma, uint32_t src_addr, uint32_t dest_addr,
                                        uint32_t size_byte)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM((size_byte > 0U) && (size_byte <= 0xFFFFU));
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma->xfer_mode != HAL_DMA_XFER_MODE_DIRECT)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
#endif /* USE_HAL_DMA_LINKEDLIST */

  HAL_CHECK_UPDATE_STATE(hdma, global_state, HAL_DMA_STATE_IDLE, HAL_DMA_STATE_ACTIVE);

#if defined (USE_HAL_DMA_GET_LAST_ERRORS) && (USE_HAL_DMA_GET_LAST_ERRORS == 1)
  hdma->last_error_codes = HAL_DMA_ERROR_NONE;
#endif /* USE_HAL_DMA_GET_LAST_ERRORS */

  DMA_StartDirectXfer(hdma, src_addr, dest_addr, size_byte, HAL_DMA_OPT_IT_DEFAULT);

  return HAL_OK;
}

/**
  * @brief  Start the DMA channel direct transfer in interrupt mode with customized optional interrupts configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @param  src_addr          Source address
  * @param  dest_addr         Destination address
  * @param  size_byte         Size in byte
  * @param  interrupts        DMA optional interrupts to be enabled.
  *                           This parameter can be one of @ref DMA_Optional_Interrupt group.
  * @retval HAL_INVALID_PARAM Invalid parameter return when transfer mode parameter is not direct
  * @retval HAL_BUSY          DMA channel state is active when calling this API
  * @retval HAL_OK            Interrupt direct transfer is successfully started
  */
hal_status_t HAL_DMA_StartDirectXfer_IT_Opt(hal_dma_handle_t *hdma, uint32_t src_addr, uint32_t dest_addr,
                                            uint32_t size_byte, uint32_t interrupts)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM((size_byte > 0U) && (size_byte <= 0xFFFFU));
  ASSERT_DBG_PARAM(IS_DMA_OPT_IT(interrupts));
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma->xfer_mode != HAL_DMA_XFER_MODE_DIRECT)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
#endif /* USE_HAL_DMA_LINKEDLIST */

  HAL_CHECK_UPDATE_STATE(hdma, global_state, HAL_DMA_STATE_IDLE, HAL_DMA_STATE_ACTIVE);

#if defined (USE_HAL_DMA_GET_LAST_ERRORS) && (USE_HAL_DMA_GET_LAST_ERRORS == 1)
  hdma->last_error_codes = HAL_DMA_ERROR_NONE;
#endif /* USE_HAL_DMA_GET_LAST_ERRORS */

  DMA_StartDirectXfer(hdma, src_addr, dest_addr, size_byte, interrupts);

  return HAL_OK;
}

/**
  * @brief  Start the DMA channel peripheral transfer.
  * @param  hdma       Pointer to DMA channel handle
  * @param  src_addr   Source address
  * @param  dest_addr  Destination address
  * @param  size_byte  Size in byte
  * @param  interrupts DMA optional interrupts to be enabled.
  *                    This parameter can be one of @ref DMA_Optional_Interrupt group.
  * @retval HAL_ERROR  Transfer mode parameter is linked list linear
  * @retval HAL_BUSY   DMA channel state is active when calling this API
  * @retval HAL_OK     Peripheral transfer is successfully started
  * @note   This function is intended exclusively for internal use by HAL PPP drivers for transfers over DMA.
  */
hal_status_t HAL_DMA_StartPeriphXfer_IT_Opt(hal_dma_handle_t *hdma, uint32_t src_addr, uint32_t dest_addr,
                                            uint32_t size_byte, uint32_t interrupts)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM((size_byte > 0U) && (size_byte <= 0xFFFFU));
  ASSERT_DBG_PARAM(IS_DMA_OPT_IT(interrupts));
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hdma, global_state, HAL_DMA_STATE_IDLE, HAL_DMA_STATE_ACTIVE);

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  /* Linear linked list mode is activated */
  if (hdma->xfer_mode == HAL_DMA_XFER_MODE_LINKEDLIST_LINEAR)
  {
    hdma->global_state = HAL_DMA_STATE_IDLE;

    return HAL_ERROR;
  }
  /* Circular linked list mode is activated */
  else if (hdma->xfer_mode == HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR)
  {
    DMA_UpdateDataNode(hdma->p_head_node, src_addr, dest_addr, size_byte);
    DMA_StartLinkedListXfer(hdma, hdma->p_head_node, interrupts);
  }
  else
#endif /* USE_HAL_DMA_LINKEDLIST */
  {
    DMA_StartDirectXfer(hdma, src_addr, dest_addr, size_byte, interrupts);
  }

  return HAL_OK;
}

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
/**
  * @brief  Start the DMA channel linked list transfer in silent mode.
  * @param  hdma              Pointer to DMA channel handle
  * @param  p_q               Pointer to hal_q_t configuration structure
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_q pointer is NULL or transfer mode parameter is direct
  * @retval HAL_BUSY          DMA channel state is active when calling this API
  * @retval HAL_OK            Silent linked list transfer is successfully started
  */
hal_status_t HAL_DMA_StartLinkedListXfer(hal_dma_handle_t *hdma, const hal_q_t *p_q)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_q == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (hdma->xfer_mode == HAL_DMA_XFER_MODE_DIRECT)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_DMA_LINKEDLIST */
#endif /* USE_HAL_CHECK_PARAM */

