MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.c
  HAL_CHECK_UPDATE_STATE(hdma, global_state, HAL_DMA_STATE_IDLE, HAL_DMA_STATE_ACTIVE);

#if defined (USE_HAL_DMA_GET_LAST_ERRORS) && (USE_HAL_DMA_GET_LAST_ERRORS == 1)
  hdma->last_error_codes = HAL_DMA_ERROR_NONE;
#endif /* USE_HAL_DMA_GET_LAST_ERRORS */

  if (p_q->p_first_circular_node != NULL)
  {
    hdma->xfer_mode = HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR;
  }

  DMA_StartLinkedListXfer(hdma, p_q->p_head_node, HAL_DMA_OPT_IT_SILENT);

  return HAL_OK;
}

/**
  * @brief  Start the DMA channel linked list transfer in interrupt mode with default optional interrupts configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @param  p_q               Pointer to hal_q_t configuration structure
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_q pointer is NULL or transfer mode parameter is direct
  * @retval HAL_BUSY          DMA channel state is active when calling this API
  * @retval HAL_OK            Interrupt linked list transfer is successfully started
  */
hal_status_t HAL_DMA_StartLinkedListXfer_IT(hal_dma_handle_t *hdma, const hal_q_t *p_q)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_q == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (hdma->xfer_mode == HAL_DMA_XFER_MODE_DIRECT)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_DMA_LINKEDLIST */
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hdma, global_state, HAL_DMA_STATE_IDLE, HAL_DMA_STATE_ACTIVE);

#if defined (USE_HAL_DMA_GET_LAST_ERRORS) && (USE_HAL_DMA_GET_LAST_ERRORS == 1)
  hdma->last_error_codes = HAL_DMA_ERROR_NONE;
#endif /* USE_HAL_DMA_GET_LAST_ERRORS */

  if (p_q->p_first_circular_node != NULL)
  {
    hdma->xfer_mode = HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR;
  }

  DMA_StartLinkedListXfer(hdma, p_q->p_head_node, HAL_DMA_OPT_IT_DEFAULT);

  return HAL_OK;
}

/**
  * @brief  Start the DMA channel linked list transfer in interrupt mode with customized optional interrupts
  *         configuration.
  * @param  hdma              Pointer to DMA channel handle
  * @param  p_q               Pointer to hal_q_t configuration structure
  * @param  interrupts        DMA optional interrupts to be enabled.
  *                           This parameter can be one of @ref DMA_Optional_Interrupt group.
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_q pointer is NULL or transfer mode parameter is direct
  * @retval HAL_BUSY          DMA channel state is active when calling this API
  * @retval HAL_OK            Interrupt linked list transfer is successfully started
  */
hal_status_t HAL_DMA_StartLinkedListXfer_IT_Opt(hal_dma_handle_t *hdma, const hal_q_t *p_q, uint32_t interrupts)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(IS_DMA_OPT_IT(interrupts));
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_IDLE);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_q == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  if (hdma->xfer_mode == HAL_DMA_XFER_MODE_DIRECT)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_DMA_LINKEDLIST */
#endif /* USE_HAL_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hdma, global_state, HAL_DMA_STATE_IDLE, HAL_DMA_STATE_ACTIVE);

#if defined (USE_HAL_DMA_GET_LAST_ERRORS) && (USE_HAL_DMA_GET_LAST_ERRORS == 1)
  hdma->last_error_codes = HAL_DMA_ERROR_NONE;
#endif /* USE_HAL_DMA_GET_LAST_ERRORS */

  if (p_q->p_first_circular_node != NULL)
  {
    hdma->xfer_mode = HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR;
  }

  DMA_StartLinkedListXfer(hdma, p_q->p_head_node, interrupts);

  return HAL_OK;
}
#endif /* USE_HAL_DMA_LINKEDLIST */

/**
  * @brief  Abort any ongoing DMA channel transfer in blocking mode.
  * @param  hdma      Pointer to DMA channel handle
  * @retval HAL_ERROR DMA channel not aborted
  * @retval HAL_OK    Transfer in blocking mode is successfully aborted
  */
hal_status_t HAL_DMA_Abort(hal_dma_handle_t *hdma)
{
  uint32_t tickstart;

  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_STATE(hdma->global_state, ((uint32_t)HAL_DMA_STATE_IDLE | (uint32_t)HAL_DMA_STATE_ACTIVE));

  if (LL_DMA_IsActiveFlag_IDLE(DMA_CHANNEL_GET_INSTANCE(hdma)) == 0U)
  {
    hdma->global_state = HAL_DMA_STATE_ABORT;

    LL_DMA_SuspendChannel(DMA_CHANNEL_GET_INSTANCE(hdma));

    tickstart = HAL_GetTick();
    while (LL_DMA_IsActiveFlag_SUSP(DMA_CHANNEL_GET_INSTANCE(hdma)) == 0U)
    {
      if ((HAL_GetTick() - tickstart) > DMA_SUSPEND_TIMEOUT)
      {
        if (LL_DMA_IsActiveFlag_IDLE(DMA_CHANNEL_GET_INSTANCE(hdma)) != 0U)
        {
          LL_DMA_ResetChannel(DMA_CHANNEL_GET_INSTANCE(hdma));

          hdma->global_state = HAL_DMA_STATE_IDLE;
        }

        /* No state change, stay in ABORT state */
        return HAL_ERROR;
      }
    }

    LL_DMA_ResetChannel(DMA_CHANNEL_GET_INSTANCE(hdma));

    LL_DMA_ClearFlag(DMA_CHANNEL_GET_INSTANCE(hdma), LL_DMA_FLAG_ALL);

    hdma->global_state = HAL_DMA_STATE_IDLE;
  }
  else
  {
    /* The channel was not transmitting upon abort request */
    /* Global state: transmission is already completed */
    hdma->global_state = HAL_DMA_STATE_IDLE;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Abort any ongoing DMA channel transfer in interrupt mode.
  * @param  hdma      Pointer to DMA channel handle
  * @retval HAL_ERROR DMA channel not aborted
  * @retval HAL_OK    Transfer in interrupt mode is successfully aborted
  */
hal_status_t HAL_DMA_Abort_IT(hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_STATE(hdma->global_state, (uint32_t)HAL_DMA_STATE_IDLE | (uint32_t)HAL_DMA_STATE_ACTIVE);

  if (LL_DMA_IsActiveFlag_IDLE(DMA_CHANNEL_GET_INSTANCE(hdma)) == 0U)
  {
    hdma->global_state = HAL_DMA_STATE_ABORT;

    LL_DMA_EnableIT_SUSP(DMA_CHANNEL_GET_INSTANCE(hdma));

    LL_DMA_SuspendChannel(DMA_CHANNEL_GET_INSTANCE(hdma));
  }
  else
  {
    /* The channel was not transmitting upon abort request */
    /* Global state: transmission is already completed */
    hdma->global_state = HAL_DMA_STATE_IDLE;
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Suspend any ongoing DMA channel transfer in blocking mode.
  * @param  hdma      Pointer to DMA channel handle
  * @retval HAL_ERROR DMA channel not suspended
  * @retval HAL_OK    Transfer in blocking mode is successfully suspended
  */
hal_status_t HAL_DMA_Suspend(hal_dma_handle_t *hdma)
{
  uint32_t tickstart;

  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_ACTIVE);

  if (LL_DMA_IsActiveFlag_IDLE(DMA_CHANNEL_GET_INSTANCE(hdma)) == 0U)
  {
    hdma->global_state = HAL_DMA_STATE_SUSPEND;

    LL_DMA_SuspendChannel(DMA_CHANNEL_GET_INSTANCE(hdma));

    tickstart = HAL_GetTick();
    while (LL_DMA_IsActiveFlag_SUSP(DMA_CHANNEL_GET_INSTANCE(hdma)) == 0U)
    {
      if ((HAL_GetTick() - tickstart) > DMA_SUSPEND_TIMEOUT)
      {
        return HAL_ERROR;
      }
    }
  }
  else
  {
    /* The channel was not transmitting upon suspend request */
    hdma->global_state = HAL_DMA_STATE_IDLE;

    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Suspend any ongoing DMA channel transfer in interrupt mode.
  * @param  hdma      Pointer to DMA channel handle
  * @retval HAL_ERROR DMA channel not suspended
  * @retval HAL_OK    Transfer in interrupt mode is successfully suspended
  */
hal_status_t HAL_DMA_Suspend_IT(hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_ACTIVE);

  if (LL_DMA_IsActiveFlag_IDLE(DMA_CHANNEL_GET_INSTANCE(hdma)) == 0U)
  {
    hdma->global_state = HAL_DMA_STATE_SUSPEND;

