MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.c
    LL_DMA_EnableIT_SUSP(DMA_CHANNEL_GET_INSTANCE(hdma));

    LL_DMA_SuspendChannel(DMA_CHANNEL_GET_INSTANCE(hdma));
  }
  else
  {
    /* The channel was not transmitting upon suspend request */
    hdma->global_state = HAL_DMA_STATE_IDLE;

    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Resume any suspended DMA channel transfer immediately.
  * @param  hdma     Pointer to DMA channel handle
  * @retval HAL_BUSY DMA channel state is active when calling this API
  * @retval HAL_OK   Transfer is successfully resumed
  */
hal_status_t HAL_DMA_Resume(hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_SUSPEND);

  HAL_CHECK_UPDATE_STATE(hdma, global_state, HAL_DMA_STATE_SUSPEND, HAL_DMA_STATE_ACTIVE);

  LL_DMA_ResumeChannel(DMA_CHANNEL_GET_INSTANCE(hdma));

  return HAL_OK;
}

/**
  * @brief  Polling for transfer status for finite DMA channel silent transfers.
  * @param  hdma         Pointer to DMA channel handle
  * @param  xfer_level   DMA channel transfer level
  * @param  timeout_ms   User timeout in milliseconds
  * @retval HAL_TIMEOUT  User timeout
  * @retval HAL_ERROR    DMA channel error
  * @retval HAL_OK       Polling for transfer is successfully configured
  */
hal_status_t HAL_DMA_PollForXfer(hal_dma_handle_t *hdma, hal_dma_xfer_level_t xfer_level, uint32_t timeout_ms)
{
  uint32_t tickstart;
  uint32_t tmp_csr;

  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(IS_DMA_XFER_LEVEL((uint32_t)xfer_level));
  ASSERT_DBG_STATE(hdma->global_state, HAL_DMA_STATE_ACTIVE);

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma->xfer_mode == HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
#endif /* USE_HAL_DMA_LINKEDLIST */

  tmp_csr = LL_DMA_READ_REG((DMA_CHANNEL_GET_INSTANCE(hdma)), CSR);

  if ((tmp_csr & LL_DMA_FLAG_TO) != 0U)
  {
#if defined(USE_HAL_DMA_GET_LAST_ERRORS) && (USE_HAL_DMA_GET_LAST_ERRORS == 1)
    hdma->last_error_codes |= HAL_DMA_ERROR_TO;
#endif /* USE_HAL_DMA_GET_LAST_ERRORS */

    LL_DMA_ClearFlag_TO(DMA_CHANNEL_GET_INSTANCE(hdma));
  }

  if ((tmp_csr & HAL_DMA_FLAG_ERROR) != 0U)
  {
#if defined(USE_HAL_DMA_GET_LAST_ERRORS) && (USE_HAL_DMA_GET_LAST_ERRORS == 1)
    /* Check the data transfer error flag */
    if ((tmp_csr & LL_DMA_FLAG_DTE) != 0U)
    {
      hdma->last_error_codes |= HAL_DMA_ERROR_DTE;
    }

    /* Check the user setting error flag */
    if ((tmp_csr & LL_DMA_FLAG_USE) != 0U)
    {
      hdma->last_error_codes |= HAL_DMA_ERROR_USE;
    }

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
    /* Check the update link error flag */
    if ((tmp_csr & LL_DMA_FLAG_ULE) != 0U)
    {
      hdma->last_error_codes |= HAL_DMA_ERROR_ULE;
    }
#endif /* USE_HAL_DMA_LINKEDLIST */
#endif /* USE_HAL_DMA_GET_LAST_ERRORS */

    LL_DMA_ClearFlag(DMA_CHANNEL_GET_INSTANCE(hdma), LL_DMA_FLAG_ALL);

    LL_DMA_ResetChannel(DMA_CHANNEL_GET_INSTANCE(hdma));

    hdma->global_state = HAL_DMA_STATE_IDLE;

    return HAL_ERROR;
  }

  /* Wait for transfer level */
  tickstart = HAL_GetTick();
  while ((LL_DMA_READ_REG((DMA_CHANNEL_GET_INSTANCE(hdma)), CSR) & (uint32_t)xfer_level) == 0U)
  {
    /* Check for the timeout */
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
      {
        if ((LL_DMA_READ_REG((DMA_CHANNEL_GET_INSTANCE(hdma)), CSR) & (uint32_t)xfer_level) == 0U)
        {
          return HAL_TIMEOUT;
        }
      }
    }
  }

  /* Clear transfer level flags */
  if (xfer_level == HAL_DMA_XFER_HALF_COMPLETE)
  {
    LL_DMA_ClearFlag(DMA_CHANNEL_GET_INSTANCE(hdma), LL_DMA_FLAG_HT);
  }
  else
  {
    LL_DMA_ClearFlag(DMA_CHANNEL_GET_INSTANCE(hdma), (LL_DMA_FLAG_TC | LL_DMA_FLAG_HT));
  }

  hdma->global_state = HAL_DMA_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief Handle any DMA channel interrupt.
  * @param hdma Pointer to DMA channel handle
  */
void HAL_DMA_IRQHandler(hal_dma_handle_t *hdma)
{
  DMA_TypeDef *instance;
  uint32_t    flags;
  uint32_t    its;
  uint32_t    channel;

  ASSERT_DBG_PARAM(hdma != NULL);

  instance = LL_DMA_GET_INSTANCE(hdma->instance);
  channel  = LL_DMA_GET_CHANNEL_IDX(hdma->instance);
  its      = LL_DMA_READ_REG((DMA_CHANNEL_GET_INSTANCE(hdma)), CCR);

  /* Check DMA channel active interrupts */
  {
    if (LL_DMA_IsActiveFlag_MIS(instance, channel) == 0U)
    {
      return; /* The global interrupt flag is low; nothing to handle */
    }
  }

  flags = LL_DMA_READ_REG((DMA_CHANNEL_GET_INSTANCE(hdma)), CSR);

  /* Half Transfer Complete Interrupt management **********************************************************************/
  if (STM32_READ_BIT((flags & its), LL_DMA_FLAG_HT) != 0U)
  {
    LL_DMA_ClearFlag_HT(DMA_CHANNEL_GET_INSTANCE(hdma));

    hdma->p_xfer_halfcplt_cb(hdma);

    if (STM32_READ_BIT((flags & its), LL_DMA_FLAG_TC) == 0U)
    {
      return;
    }
  }

  /* Transfer Complete Interrupt management ***************************************************************************/
  if (STM32_READ_BIT((flags & its), LL_DMA_FLAG_TC) != 0U)
  {
    LL_DMA_ClearFlag_TC(DMA_CHANNEL_GET_INSTANCE(hdma));

    /* Check if there are remaining data */
    if (LL_DMA_IsActiveFlag_IDLE(DMA_CHANNEL_GET_INSTANCE(hdma)) != 0U)
    {
      LL_DMA_ClearFlag_HT(DMA_CHANNEL_GET_INSTANCE(hdma));

      LL_DMA_DisableIT(DMA_CHANNEL_GET_INSTANCE(hdma), LL_DMA_IT_ALL);

      hdma->global_state = HAL_DMA_STATE_IDLE;
    }

    hdma->p_xfer_cplt_cb(hdma);

    return;
  }

  /* Suspend Transfer Interrupt management ****************************************************************************/
  if (STM32_READ_BIT((flags & its), LL_DMA_FLAG_SUSP) != 0U)
  {
    LL_DMA_ClearFlag_SUSP(DMA_CHANNEL_GET_INSTANCE(hdma));

    if (hdma->global_state == HAL_DMA_STATE_ABORT)
    {
      LL_DMA_ResetChannel(DMA_CHANNEL_GET_INSTANCE(hdma));

      LL_DMA_DisableIT(DMA_CHANNEL_GET_INSTANCE(hdma), LL_DMA_IT_ALL);

      hdma->global_state = HAL_DMA_STATE_IDLE;

      hdma->p_xfer_abort_cb(hdma);
    }
    else
    {
      LL_DMA_DisableIT_SUSP(DMA_CHANNEL_GET_INSTANCE(hdma));

      hdma->global_state = HAL_DMA_STATE_SUSPEND;

      hdma->p_xfer_suspend_cb(hdma);
    }

    return;
  }

  /* Error Interrupt management ***************************************************************************************/
  DMA_HandleErrorIT(hdma, STM32_READ_BIT((flags & its), (HAL_DMA_FLAG_ERROR | LL_DMA_FLAG_TO)));
}
/**
  * @}
  */

