MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.c
/** @addtogroup DMA_Exported_Functions_Group5
  * @{

This subsection provides a set of functions to register the DMA channel process and error callbacks:

- Call the function HAL_DMA_RegisterXferHalfCpltCallback() to register the DMA channel half transfer complete callback

- Call the function HAL_DMA_RegisterXferCpltCallback() to register the DMA channel transfer complete callback

- Call the function HAL_DMA_RegisterXferAbortCallback() to register the DMA channel abort callback

- Call the function HAL_DMA_RegisterXferSuspendCallback() to register the DMA channel suspend callback

- Call the function HAL_DMA_RegisterXferErrorCallback() to register the DMA channel error callback

- Call the function HAL_DMA_SetUserData() to set a user data in handle

- Call the function HAL_DMA_GetUserData() to get a user data from handle
  */

/**
  * @brief  Store the given callback into the DMA handle.
  * @param  hdma              Pointer to DMA channel handle
  * @param  callback          Half transfer complete callback
  * @retval HAL_INVALID_PARAM Invalid parameter return when callback pointer is NULL
  * @retval HAL_OK            DMA channel half transfer complete callback is successfully stored
  */
hal_status_t HAL_DMA_RegisterXferHalfCpltCallback(hal_dma_handle_t *hdma, hal_dma_cb_t callback)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hdma->p_xfer_halfcplt_cb = callback;

  return HAL_OK;
}

/**
  * @brief  Store the given callback into the DMA handle.
  * @param  hdma              Pointer to DMA channel handle
  * @param  callback          Transfer complete callback
  * @retval HAL_INVALID_PARAM Invalid parameter return when callback pointer is NULL
  * @retval HAL_OK            DMA channel transfer complete callback is successfully stored
  */
hal_status_t HAL_DMA_RegisterXferCpltCallback(hal_dma_handle_t *hdma, hal_dma_cb_t callback)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hdma->p_xfer_cplt_cb = callback;

  return HAL_OK;
}

/**
  * @brief  Store the given callback into the DMA handle.
  * @param  hdma              Pointer to DMA channel handle
  * @param  callback          Abort callback
  * @retval HAL_INVALID_PARAM Invalid parameter return when callback pointer is NULL
  * @retval HAL_OK            DMA channel abort transfer callback is successfully stored
  */
hal_status_t HAL_DMA_RegisterXferAbortCallback(hal_dma_handle_t *hdma, hal_dma_cb_t callback)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hdma->p_xfer_abort_cb = callback;

  return HAL_OK;
}

/**
  * @brief  Store the given callback into the DMA handle.
  * @param  hdma              Pointer to DMA channel handle
  * @param  callback          Suspend callback
  * @retval HAL_INVALID_PARAM Invalid parameter return when callback pointer is NULL
  * @retval HAL_OK            DMA channel suspend transfer callback is successfully stored
  */
hal_status_t HAL_DMA_RegisterXferSuspendCallback(hal_dma_handle_t *hdma, hal_dma_cb_t callback)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hdma->p_xfer_suspend_cb = callback;

  return HAL_OK;
}

/**
  * @brief  Store the given callback into the DMA handle.
  * @param  hdma              Pointer to DMA channel handle
  * @param  callback          Error callback
  * @retval HAL_INVALID_PARAM Invalid parameter return when callback pointer is NULL
  * @retval HAL_OK            DMA channel error transfer callback is successfully stored
  */
hal_status_t HAL_DMA_RegisterXferErrorCallback(hal_dma_handle_t *hdma, hal_dma_cb_t callback)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hdma->p_xfer_error_cb = callback;

  return HAL_OK;
}

/**
  * @brief DMA channel half transfer complete default callback.
  * @param hdma Pointer to DMA channel handle
  */
__WEAK void HAL_DMA_XferHalfCpltCallback(hal_dma_handle_t *hdma)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hdma);

  /*! <b>NOTE:</b> This is a weak function and must not be modified, when the callback is needed, the
                   HAL_DMA_RegisterXferHalfCpltCallback() must be implemented in the user file */
}

/**
  * @brief DMA channel transfer complete default callback.
  * @param hdma Pointer to DMA channel handle
  */
__WEAK void HAL_DMA_XferCpltCallback(hal_dma_handle_t *hdma)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hdma);

  /*! <b>NOTE:</b> This is a weak function and must not be modified, when the callback is needed, the
                   HAL_DMA_RegisterXferCpltCallback() must be implemented in the user file */
}

/**
  * @brief DMA channel abort default callback.
  * @param hdma Pointer to DMA channel handle
  */
__WEAK void HAL_DMA_XferAbortCallback(hal_dma_handle_t *hdma)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hdma);

  /*! <b>NOTE:</b> This is a weak function and must not be modified, when the callback is needed, the
                   HAL_DMA_RegisterXferAbortCallback() must be implemented in the user file */
}

/**
  * @brief DMA channel suspend default callback.
  * @param hdma Pointer to DMA channel handle
  */
__WEAK void HAL_DMA_XferSuspendCallback(hal_dma_handle_t *hdma)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hdma);

