MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.c
  /*! <b>NOTE:</b> This is a weak function and must not be modified, when the callback is needed, the
                   HAL_DMA_RegisterXferSuspendCallback() must be implemented in the user file */
}

/**
  * @brief DMA channel suspend default callback.
  * @param hdma Pointer to DMA channel handle
  */
__WEAK void HAL_DMA_XferErrorCallback(hal_dma_handle_t *hdma)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hdma);

  /*! <b>NOTE:</b> This is a weak function and must not be modified, when the callback is needed, the
                   HAL_DMA_RegisterXferErrorCallback() must be implemented in the user file */
}

#if defined(USE_HAL_DMA_USER_DATA) && (USE_HAL_DMA_USER_DATA == 1)
/**
  * @brief Store the user data into the DMA channel handle.
  * @param hdma        Pointer to DMA channel handle
  * @param p_user_data Pointer to the user data
  */
void HAL_DMA_SetUserData(hal_dma_handle_t *hdma, const void *p_user_data)
{
  ASSERT_DBG_PARAM(hdma != NULL);

  hdma->p_user_data = p_user_data;
}

/**
  * @brief  Retrieve the user data from the DMA channel handle.
  * @param  hdma Pointer to DMA channel handle
  * @retval Pointer to the user data
  */
const void *HAL_DMA_GetUserData(const hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);

  return (hdma->p_user_data);
}
#endif /* USE_HAL_DMA_USER_DATA */
/**
  * @}
  */

/** @addtogroup DMA_Exported_Functions_Group6
  * @{

This subsection provides a set of functions to get the DMA channel data information and status:

- Call the function HAL_DMA_GetDirectXferRemainingDataByte() to get the DMA channel remaining data within the current
  transfer in byte

- Call the function HAL_DMA_GetState() to get the DMA channel current state

- Call the function HAL_DMA_GetLastErrorCodes() to get the DMA channel last errors codes
  */

/**
  * @brief  Get the DMA channel remaining data in the current transfer in byte.
  * @param  hdma     Pointer to DMA channel handle
  * @retval uint32_t Direct transfer remaining data in byte
  */
uint32_t HAL_DMA_GetDirectXferRemainingDataByte(const hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_STATE(hdma->global_state,
                   (uint32_t)HAL_DMA_STATE_IDLE | (uint32_t)HAL_DMA_STATE_ACTIVE | (uint32_t)HAL_DMA_STATE_SUSPEND);

  return (LL_DMA_GetBlkDataLength(DMA_CHANNEL_GET_INSTANCE(hdma))
         );
}

/**
  * @brief  Get the DMA channel current state.
  * @param  hdma            Pointer to DMA channel handle
  * @retval hal_dma_state_t DMA channel state
  */
hal_dma_state_t HAL_DMA_GetState(const hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);

  return (hdma->global_state);
}

#if defined (USE_HAL_DMA_GET_LAST_ERRORS) && (USE_HAL_DMA_GET_LAST_ERRORS == 1)
/**
  * @brief  Get last error codes.
  * @param  hdma     Pointer to DMA channel handle
  * @retval uint32_t Last error codes which can be a combination of @ref DMA_Error_Code
  */
uint32_t HAL_DMA_GetLastErrorCodes(const hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hdma != NULL);

  return (hdma->last_error_codes);
}
#endif /* USE_HAL_DMA_GET_LAST_ERRORS */
/**
  * @}
  */

/**
  * @}
  */

/* Private functions -------------------------------------------------------------------------------------------------*/
/** @addtogroup DMA_Private_Functions
  * @{
  */

/**
  * @brief Set the DMA channel transfer configuration.
  * @param hdma     Pointer to DMA channel handle
  * @param p_config Pointer to @ref hal_dma_direct_xfer_config_t configuration structure
  */
static void DMA_SetConfigDirectXfer(hal_dma_handle_t *hdma, const hal_dma_direct_xfer_config_t *p_config)
{
  LL_DMA_SetChannelPriorityLevel(DMA_CHANNEL_GET_INSTANCE(hdma), (uint32_t)p_config->priority);
  LL_DMA_ConfigTransfer(DMA_CHANNEL_GET_INSTANCE(hdma),
                        ((uint32_t)p_config->dest_inc | (uint32_t)p_config->dest_data_width |
                         (uint32_t)p_config->src_inc  | (uint32_t)p_config->src_data_width));

  if (p_config->direction != HAL_DMA_DIRECTION_MEMORY_TO_MEMORY)
  {
    LL_DMA_SetPeriphRequest(DMA_CHANNEL_GET_INSTANCE(hdma), (uint32_t)p_config->request);
  }

  LL_DMA_SetDataTransferDirection(DMA_CHANNEL_GET_INSTANCE(hdma), (uint32_t)p_config->direction);
  LL_DMA_SetHWRequestMode(DMA_CHANNEL_GET_INSTANCE(hdma), (uint32_t)HAL_DMA_HARDWARE_REQUEST_BURST);
}

/**
  * @brief Get the DMA channel transfer configuration.
  * @param hdma     Pointer to DMA channel handle
  * @param p_config Pointer to @ref hal_dma_direct_xfer_config_t configuration structure
  */
static void DMA_GetConfigDirectXfer(hal_dma_handle_t *hdma, hal_dma_direct_xfer_config_t *p_config)
{
  p_config->request         = (hal_dma_request_source_t)LL_DMA_GetPeriphRequest(DMA_CHANNEL_GET_INSTANCE(hdma));
  p_config->direction       = (hal_dma_direction_t)LL_DMA_GetDataTransferDirection(DMA_CHANNEL_GET_INSTANCE(hdma));
  p_config->src_inc         = (hal_dma_src_addr_increment_t)LL_DMA_GetSrcIncMode(DMA_CHANNEL_GET_INSTANCE(hdma));
  p_config->dest_inc        = (hal_dma_dest_addr_increment_t)LL_DMA_GetDestIncMode(DMA_CHANNEL_GET_INSTANCE(hdma));
  p_config->src_data_width  = (hal_dma_src_data_width_t)LL_DMA_GetSrcDataWidth(DMA_CHANNEL_GET_INSTANCE(hdma));
  p_config->dest_data_width = (hal_dma_dest_data_width_t)LL_DMA_GetDestDataWidth(DMA_CHANNEL_GET_INSTANCE(hdma));
  p_config->priority        = (hal_dma_priority_t)LL_DMA_GetChannelPriorityLevel(DMA_CHANNEL_GET_INSTANCE(hdma));
}

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
/**
  * @brief Set the DMA channel linked list transfer configuration.
  * @param hdma     Pointer to DMA channel handle
  * @param p_config Pointer to @ref hal_dma_linkedlist_xfer_config_t configuration structure
  */
static void DMA_SetConfigLinkedListXfer(hal_dma_handle_t *hdma, const hal_dma_linkedlist_xfer_config_t *p_config)
{
  LL_DMA_ConfigControl(DMA_CHANNEL_GET_INSTANCE(hdma), ((uint32_t)p_config->priority));
  LL_DMA_SetTransferEventMode(DMA_CHANNEL_GET_INSTANCE(hdma), (uint32_t)p_config->xfer_event_mode);
  LL_DMA_SetBlkDataLength(DMA_CHANNEL_GET_INSTANCE(hdma), 0U);
}

/**
  * @brief Get the DMA channel linked list transfer configuration.
  * @param hdma     Pointer to DMA channel handle
  * @param p_config Pointer to @ref hal_dma_linkedlist_xfer_config_t configuration structure
  */
static void DMA_GetConfigLinkedListXfer(hal_dma_handle_t *hdma, hal_dma_linkedlist_xfer_config_t *p_config)
{
  p_config->priority = (hal_dma_priority_t)LL_DMA_GetChannelPriorityLevel(DMA_CHANNEL_GET_INSTANCE(hdma));
  p_config->xfer_event_mode = (hal_dma_linkedlist_xfer_event_mode_t)
                              LL_DMA_GetTransferEventMode(DMA_CHANNEL_GET_INSTANCE(hdma));
}

/**
  * @brief Fill the DMA channel linked list node configuration.
  * @param p_conf    Pointer to @ref hal_dma_node_config_t configuration structure
  * @param p_node    Pointer to @ref hal_dma_node_t node structure
  * @param node_type Element in @ref hal_dma_node_type_t enumeration
  */
static void DMA_FillNodeConfig(hal_dma_node_t *p_node, const hal_dma_node_config_t *p_conf,
                               hal_dma_node_type_t node_type)
{
  uint32_t idx   = 0U;
  uint32_t dummy;

  /* Update CTR1 register value */
  dummy = (uint32_t)p_conf->xfer.src_inc | (uint32_t)p_conf->xfer.dest_inc | (uint32_t)p_conf->xfer.src_data_width |
          (uint32_t)p_conf->xfer.dest_data_width |
          (uint32_t)p_conf->data_handling.trunc_padd;

