MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.c
  STM32_WRITE_REG(p_node->regs[idx], dummy);


  idx++;

  /* Update CTR2 register value */
  dummy = (uint32_t)p_conf->hw_request_mode                                     |
          (uint32_t)p_conf->flow_ctrl_mode                                      |
          (uint32_t)p_conf->xfer_event_mode                                     |
          (uint32_t)p_conf->xfer.direction                                      |
          ((uint32_t)p_conf->xfer.request & (DMA_CTR2_REQSEL | DMA_CTR2_SWREQ)) |
          (uint32_t)p_conf->trigger.mode                                        |
          (uint32_t)p_conf->trigger.polarity                                    |
          (((uint32_t)p_conf->trigger.source << DMA_CTR2_TRIGSEL_Pos) & DMA_CTR2_TRIGSEL);

  STM32_WRITE_REG(p_node->regs[idx], dummy);

  idx++;

  /* Update CBR1 register value */
  STM32_WRITE_REG(p_node->regs[idx], (uint32_t)(p_conf->size_byte & DMA_CBR1_BNDT));

  idx++;

  /* Update CSAR register value */
  p_node->regs[idx] = (uint32_t)p_conf->src_addr;

  idx++;

  /* Update CDAR register value */
  p_node->regs[idx] = (uint32_t)p_conf->dest_addr;

  idx++;

  /* Reset CLLR register value */
  STM32_WRITE_REG(p_node->regs[idx], 0U);

  /* Set node type */
  p_node->info = (uint32_t)node_type;
}

/**
  * @brief Get node configuration of DMA channel linked list.
  * @param p_node      Pointer to @ref hal_dma_node_t node structure
  * @param p_conf      Pointer to @ref hal_dma_node_config_t configuration structure
  * @param p_node_type Pointer to @ref hal_dma_node_type_t enumeration
  */
static void DMA_GetConfigNode(const hal_dma_node_t *p_node, hal_dma_node_config_t *p_conf,
                              hal_dma_node_type_t *p_node_type)
{
  uint32_t dummy;

  /* Get node type */
  *p_node_type = (hal_dma_node_type_t)p_node->info;

  /* Get CTR1 fields values */
  dummy = p_node->regs[DMA_NODE_CTR1_REG_OFFSET] & DMA_CTR1_SINC;
  p_conf->xfer.src_inc = (hal_dma_src_addr_increment_t)dummy;
  dummy = p_node->regs[DMA_NODE_CTR1_REG_OFFSET] & DMA_CTR1_DINC;
  p_conf->xfer.dest_inc = (hal_dma_dest_addr_increment_t)dummy;
  dummy = p_node->regs[DMA_NODE_CTR1_REG_OFFSET] & DMA_CTR1_SDW_LOG2;
  p_conf->xfer.src_data_width = (hal_dma_src_data_width_t)dummy;
  dummy = p_node->regs[DMA_NODE_CTR1_REG_OFFSET] & DMA_CTR1_DDW_LOG2;
  p_conf->xfer.dest_data_width = (hal_dma_dest_data_width_t)dummy;
  dummy = p_node->regs[DMA_NODE_CTR1_REG_OFFSET] & DMA_CTR1_PAM_0;
  p_conf->data_handling.trunc_padd = (hal_dma_dest_data_trunc_padd_t)dummy;


  /* Get CTR2 fields values */
  if ((p_node->regs[DMA_NODE_CTR2_REG_OFFSET] & DMA_CTR2_SWREQ) != 0U)
  {
    p_conf->xfer.request   = HAL_DMA_REQUEST_SW;
    p_conf->xfer.direction = HAL_DMA_DIRECTION_MEMORY_TO_MEMORY;
  }
  else
  {
    dummy = p_node->regs[DMA_NODE_CTR2_REG_OFFSET] & DMA_CTR2_REQSEL;
    p_conf->xfer.request = (hal_dma_request_source_t)dummy;
    p_conf->xfer.direction = HAL_DMA_DIRECTION_PERIPH_TO_MEMORY;
  }

  dummy = p_node->regs[DMA_NODE_CTR2_REG_OFFSET] & DMA_CTR2_BREQ;
  p_conf->hw_request_mode = (hal_dma_hardware_request_mode_t)dummy;
  dummy = p_node->regs[DMA_NODE_CTR2_REG_OFFSET] & DMA_CTR2_PFREQ;
  p_conf->flow_ctrl_mode = (hal_dma_flow_control_mode_t)dummy;
  dummy = p_node->regs[DMA_NODE_CTR2_REG_OFFSET] & DMA_CTR2_TRIGM;
  p_conf->trigger.mode = (hal_dma_trigger_mode_t)dummy;
  dummy = p_node->regs[DMA_NODE_CTR2_REG_OFFSET] & DMA_CTR2_TRIGPOL;
  p_conf->trigger.polarity = (hal_dma_trigger_polarity_t)dummy;
  dummy = (p_node->regs[DMA_NODE_CTR2_REG_OFFSET] & DMA_CTR2_TRIGSEL) >> DMA_CTR2_TRIGSEL_Pos;
  p_conf->trigger.source = (hal_dma_trigger_source_t)dummy;
  dummy = p_node->regs[DMA_NODE_CTR2_REG_OFFSET] & DMA_CTR2_TCEM;
  p_conf->xfer_event_mode = (hal_dma_linkedlist_xfer_event_mode_t)dummy;

  /* Get CBR1 fields */
  p_conf->size_byte = p_node->regs[DMA_NODE_CBR1_REG_OFFSET] & DMA_CBR1_BNDT;

  /* Get CSAR field */
  p_conf->src_addr  = p_node->regs[DMA_NODE_CSAR_REG_OFFSET];

  /* Get CDAR field */
  p_conf->dest_addr = p_node->regs[DMA_NODE_CDAR_REG_OFFSET];

  STM32_UNUSED(dummy);
}

/**
  * @brief Fill the DMA channel linked list node direct transfer.
  * @param p_node          Pointer to @ref hal_dma_node_t configuration structure
  * @param p_config        Pointer to @ref hal_dma_direct_xfer_config_t node structure
  * @param node_type       Element in @ref hal_dma_node_type_t enumeration
  * @param xfer_event_mode Element in @ref hal_dma_linkedlist_xfer_event_mode_t enumeration
  */
static void DMA_FillNodeDirectXfer(hal_dma_node_t *p_node, const hal_dma_direct_xfer_config_t *p_config,
                                   hal_dma_node_type_t node_type, hal_dma_linkedlist_xfer_event_mode_t xfer_event_mode)
{

  hal_dma_node_config_t p_conf;

  /* Set direct transfer configuration */
  p_conf.xfer.request                         = p_config->request;
  p_conf.hw_request_mode                      = HAL_DMA_HARDWARE_REQUEST_BURST;
  p_conf.flow_ctrl_mode                       = HAL_DMA_FLOW_CONTROL_DMA;
  p_conf.xfer.direction                       = p_config->direction;
  p_conf.xfer.src_inc                         = p_config->src_inc;
  p_conf.xfer.dest_inc                        = p_config->dest_inc;
  p_conf.xfer.src_data_width                  = p_config->src_data_width;
  p_conf.xfer.dest_data_width                 = p_config->dest_data_width;
  p_conf.xfer_event_mode                      = xfer_event_mode;
  p_conf.trigger.source                       = HAL_LPDMA1_TRIGGER_EXTI0;
  p_conf.trigger.mode                         = HAL_DMA_TRIGGER_SINGLE_BURST_TRANSFER;
  p_conf.trigger.polarity                     = HAL_DMA_TRIGGER_POLARITY_MASKED;
  p_conf.data_handling.trunc_padd             = HAL_DMA_DEST_DATA_TRUNC_LEFT_PADD_ZERO;
  p_conf.src_addr                             = 0U;
  p_conf.dest_addr                            = 0U;
  p_conf.size_byte                            = 0U;


  DMA_FillNodeConfig(p_node, &p_conf, node_type);
}

/**
  * @brief Update the DMA channel linked list node.
  * @param p_node    Pointer to @ref hal_dma_node_t node structure
  * @param src_addr  Source address
  * @param dest_addr Destination address
  * @param size_byte Size in byte
  */
static void DMA_UpdateDataNode(hal_dma_node_t *p_node, uint32_t src_addr, uint32_t dest_addr, uint32_t size_byte)
{
  p_node->regs[DMA_NODE_CBR1_REG_OFFSET] = size_byte;
  p_node->regs[DMA_NODE_CSAR_REG_OFFSET] = src_addr;
  p_node->regs[DMA_NODE_CDAR_REG_OFFSET] = dest_addr;
}

/**
  * @brief Convert linked list queue associated to the handle to dynamic format.
  * @param p_q Pointer to hal_q_t configuration structure
  */
static void DMA_ConvertQNodesToDynamic(hal_q_t *p_q)
{
  uint32_t cllr_offset;
  uint32_t currentnode_position = 0U;
  uint32_t currentnode_address  = 0U;

  uint32_t currentnode_addr;
  hal_dma_node_t context_node = {0};

  cllr_offset = ((hal_dma_node_t *)(p_q->p_head_node))->info;

  /* Check unexpected node format */
  if (cllr_offset == (uint32_t)HAL_DMA_NODE_LINEAR_ADDRESSING)
  {
    /* Check queue circularity */
    if (p_q->p_first_circular_node != 0U)
    {
      /* Check that previous node is linked to the selected queue */
      while (currentnode_position < p_q->node_nbr)
      {
        /* Get head node address */
        if (currentnode_position == 0U)
        {
          currentnode_address = (uint32_t)p_q->p_head_node & DMA_CLLR_LA;
        }
        /* Calculate nodes addresses */
        else
        {
          currentnode_address =
            ((hal_dma_node_t *)(currentnode_address + ((uint32_t)p_q->p_head_node & DMA_CLBAR_LBA)))->regs[cllr_offset]
            & DMA_CLLR_LA;
        }

        currentnode_position++;
      }

      currentnode_address = currentnode_address | ((uint32_t)p_q->p_head_node & DMA_CLBAR_LBA);
    }

    currentnode_addr = (uint32_t)p_q->p_head_node;

