MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.c
    /* Store register value */
    for (uint32_t reg_idx = 0U; reg_idx < DMA_NODE_REGISTER_NUM; reg_idx++)
    {
      context_node.regs[reg_idx] = ((hal_dma_node_t *)p_q->p_head_node)->regs[reg_idx];
    }

    context_node.info = ((hal_dma_node_t *)p_q->p_head_node)->info;

    /* Convert all nodes to dyncamic (Bypass head node) */
    for (uint32_t node_count = 1U; node_count < p_q->node_nbr; node_count++)
    {
      STM32_MODIFY_REG(currentnode_addr, DMA_CLLR_LA, (context_node.regs[cllr_offset] & DMA_CLLR_LA));

      /* Bypass the first circular node when first circular node is not the last queue node */
      if (((uint32_t)p_q->p_first_circular_node != 0U)
          && ((uint32_t)p_q->p_first_circular_node != currentnode_address)
          && ((uint32_t)p_q->p_first_circular_node == currentnode_addr))
      {
        /* Copy first circular node to context node */
        for (uint32_t reg_idx = 0U; reg_idx < DMA_NODE_REGISTER_NUM; reg_idx++)
        {
          context_node.regs[reg_idx] = ((hal_dma_node_t *)p_q->p_first_circular_node)->regs[reg_idx];
        }

        context_node.info = ((hal_dma_node_t *)p_q->p_first_circular_node)->info;
      }
      else
      {
        DMA_List_ConvertNodeToDynamic((uint32_t)&context_node, currentnode_addr, (cllr_offset + 1U));
      }
    }

    /* Check if first circular node is the last node queue */
    if (((uint32_t)p_q->p_first_circular_node != 0U)
        && ((uint32_t)p_q->p_first_circular_node != currentnode_address))
    {
      DMA_List_UpdateDynamicQueueNodesCLLR(p_q, DMA_LASTNODE_ISNOT_CIRCULAR);
    }
    else
    {
      DMA_List_UpdateDynamicQueueNodesCLLR(p_q, DMA_LASTNODE_IS_CIRCULAR);
    }
  }
}

/**
  * @brief Convert linked list queue associated to the handle to static format.
  * @param p_q Pointer to hal_q_t configuration structure
  */
static void DMA_ConvertQNodesToStatic(hal_q_t *p_q)
{
  uint32_t cllr_offset;
  uint32_t currentnode_addr;
  hal_dma_node_t context_node = {0};

  currentnode_addr = (uint32_t)p_q->p_head_node;

  cllr_offset = ((hal_dma_node_t *)(p_q->p_head_node))->info;

  /* Check unexpected node format */
  if (cllr_offset == (uint32_t)HAL_DMA_NODE_LINEAR_ADDRESSING)
  {
    DMA_List_UpdateStaticQueueNodesCLLR(p_q, DMA_UPDATE_CLLR_POSITION);

    /* Convert all nodes to static (Bypass head node) */
    for (uint32_t node_count = 1U; node_count < p_q->node_nbr; node_count++)
    {
      /* Update context node register values */
      for (uint32_t reg_idx = 0U; reg_idx < DMA_NODE_REGISTER_NUM; reg_idx++)
      {
        context_node.regs[reg_idx] = ((hal_dma_node_t *)currentnode_addr)->regs[reg_idx];
      }

      context_node.info = ((hal_dma_node_t *)currentnode_addr)->info;

      STM32_MODIFY_REG(currentnode_addr, DMA_CLLR_LA, (context_node.regs[cllr_offset] & DMA_CLLR_LA));

      DMA_List_ConvertNodeToStatic((uint32_t)&context_node, currentnode_addr, (cllr_offset + 1U));
    }

    DMA_List_UpdateStaticQueueNodesCLLR(p_q, DMA_UPDATE_CLLR_VALUE);
  }
}

/**
  * @brief Convert node to dynamic.
  * @param context_node_addr The context node address
  * @param current_node_addr The current node address to be converted
  * @param reg_nbr           The register number to be converted
  */
static void DMA_List_ConvertNodeToDynamic(uint32_t context_node_addr, uint32_t current_node_addr, uint32_t reg_nbr)
{
  /* Check unexpected node format */
  if (reg_nbr == ((uint32_t)HAL_DMA_NODE_LINEAR_ADDRESSING + (uint32_t)1U))
  {
    uint32_t currentnode_reg_counter = 0U;
    uint32_t contextnode_reg_counter = 0U;
    uint32_t cllr_idx = reg_nbr - 1U;
    uint32_t update_link[DMA_NODE_REGISTER_NUM] = {DMA_CLLR_UT1, DMA_CLLR_UT2, DMA_CLLR_UB1, DMA_CLLR_USA,
                                                   DMA_CLLR_UDA, DMA_CLLR_ULL
                                                  };
    hal_dma_node_t *context_node = (hal_dma_node_t *)context_node_addr;
    hal_dma_node_t *current_node = (hal_dma_node_t *)current_node_addr;

    /* Update ULL position according to register number */
    update_link[cllr_idx] = update_link[DMA_NODE_REGISTER_NUM - 1U];

    /* Repeat for all node registers */
    while (contextnode_reg_counter != reg_nbr)
    {
      /* Check if register values are equal (exception for CSAR, CDAR and CLLR registers) */
      if ((context_node->regs[contextnode_reg_counter]  == current_node->regs[currentnode_reg_counter])
          && (contextnode_reg_counter != DMA_NODE_CSAR_DEFAULT_OFFSET)
          && (contextnode_reg_counter != (reg_nbr - 1U)))
      {
        DMA_List_FormatNode(current_node, currentnode_reg_counter, reg_nbr, DMA_NODE_DYNAMIC_FORMAT);

        /* Out of bounds check */
        if (cllr_idx == 0U)
        {
          break;
        }
        cllr_idx--;
        current_node->regs[cllr_idx] &= ~update_link[contextnode_reg_counter];
      }
      else
      {
        context_node->regs[contextnode_reg_counter] = current_node->regs[currentnode_reg_counter];

        current_node->regs[cllr_idx] |= update_link[contextnode_reg_counter];

        currentnode_reg_counter++;
      }

      contextnode_reg_counter++;
    }

    STM32_MODIFY_REG(current_node->info, DMA_NODE_CLLR_IDX, ((currentnode_reg_counter - 1U) << DMA_NODE_CLLR_IDX_POS));

    DMA_List_ClearUnusedFields(current_node, currentnode_reg_counter);
  }
}

/**
  * @brief Convert node to static.
  * @param context_node_addr The context node address.
  * @param current_node_addr The current node address to be converted.
  * @param reg_nbr           The register number to be converted.
  */
static void DMA_List_ConvertNodeToStatic(uint32_t context_node_addr, uint32_t current_node_addr, uint32_t reg_nbr)
{
  /* Check unexpected node format */
  if (reg_nbr == ((uint32_t)HAL_DMA_NODE_LINEAR_ADDRESSING + (uint32_t)1U))
  {
    hal_dma_node_t *context_node = (hal_dma_node_t *)context_node_addr;
    hal_dma_node_t *current_node = (hal_dma_node_t *)current_node_addr;
    uint32_t contextnode_reg_counter = 0U;
    uint32_t update_link[DMA_NODE_REGISTER_NUM] = {DMA_CLLR_UT1, DMA_CLLR_UT2, DMA_CLLR_UB1, DMA_CLLR_USA,
                                                   DMA_CLLR_UDA, DMA_CLLR_ULL
                                                  };
    uint32_t cllr_mask;
    uint8_t  cllr_idx;

