MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.c
    /* Update ULL position according to register number */
    update_link[reg_nbr - 1U] = update_link[DMA_NODE_REGISTER_NUM - 1U];

    /* Get context node CLLR information */
    cllr_idx  = (uint8_t)context_node->info & 0x7U;

    /* Check node info is HAL_DMA_NODE_LINEAR_ADDRESSING */
    /* Act as a defensive check in the event node info has been corrupted in memory */
    if (cllr_idx != (uint8_t)HAL_DMA_NODE_LINEAR_ADDRESSING)
    {
      /* Node type is unexpected. Set to default addressing mode (linear) */
      cllr_idx = (uint8_t)HAL_DMA_NODE_LINEAR_ADDRESSING;
    }

    current_node->info = cllr_idx;
    cllr_mask = (uint32_t)context_node->regs[cllr_idx];

    while (contextnode_reg_counter != reg_nbr)
    {
      /* Check if node field is dynamic */
      if ((cllr_mask & update_link[contextnode_reg_counter]) == 0U)
      {
        DMA_List_FormatNode(current_node, contextnode_reg_counter, reg_nbr, DMA_NODE_STATIC_FORMAT);

        current_node->regs[contextnode_reg_counter] = context_node->regs[contextnode_reg_counter];
      }

      contextnode_reg_counter++;
    }
  }
}

/**
  * @brief Update CLLR for all dynamic queue nodes.
  * @param p_q                   Pointer to a hal_q_t structure that contains queue information
  * @param last_node_is_circular The first circular node is the last queue node or not
  */
static void DMA_List_UpdateDynamicQueueNodesCLLR(const hal_q_t *p_q, uint32_t last_node_is_circular)
{
  uint32_t previous_cllr_offset;
  uint32_t current_cllr_offset = 0U;
  uint32_t previousnode_addr;
  uint32_t currentnode_addr = (uint32_t)p_q->p_head_node;
  uint32_t cllr_mask = LL_DMA_UPDATE_ALL;
  uint32_t node_idx = 0U;

  /*  Repeat for all register nodes */
  while (node_idx < p_q->node_nbr)
  {
    /* Get head node address */
    if (node_idx == 0U)
    {
      current_cllr_offset = ((hal_dma_node_t *)currentnode_addr)->info;
    }
    /* Calculate nodes addresses */
    else
    {
      previousnode_addr = currentnode_addr;
      previous_cllr_offset = current_cllr_offset;

      currentnode_addr = (((hal_dma_node_t *)(previousnode_addr))->regs[previous_cllr_offset] & DMA_CLLR_LA) +
                         ((uint32_t)p_q->p_head_node & DMA_CLBAR_LBA);
      if (((hal_dma_node_t *)currentnode_addr)->info == (uint32_t)HAL_DMA_NODE_LINEAR_ADDRESSING)
      {
        current_cllr_offset = ((hal_dma_node_t *)currentnode_addr)->info;
      }
      else
      {
        current_cllr_offset = (((hal_dma_node_t *)currentnode_addr)->info >> 8U);
      }

      cllr_mask = (((hal_dma_node_t *)currentnode_addr)->regs[current_cllr_offset] & ~DMA_CLLR_LA) |
                  (((hal_dma_node_t *)(previousnode_addr))->regs[previous_cllr_offset] & DMA_CLLR_LA);

      ((hal_dma_node_t *)(previousnode_addr))->regs[previous_cllr_offset] = cllr_mask;
    }

    node_idx++;
  }

  /* Check queue circularity */
  if (p_q->p_first_circular_node != 0U)
  {
    /* First circular queue is not last queue node */
    if (last_node_is_circular == 0U)
    {
      DMA_List_GetCLLRNodeInfo(((hal_dma_node_t *)currentnode_addr), &cllr_mask, NULL);

      ((hal_dma_node_t *)currentnode_addr)->regs[current_cllr_offset] =
        ((uint32_t)p_q->p_first_circular_node & DMA_CLLR_LA) | cllr_mask;
    }
    /* First circular queue is last queue node */
    else
    {
      /* Disable CLLR updating */
      ((hal_dma_node_t *)currentnode_addr)->regs[current_cllr_offset] &= ~DMA_CLLR_ULL;
    }
  }
  else
  {
    /* Clear CLLR register for last node */
    ((hal_dma_node_t *)currentnode_addr)->regs[current_cllr_offset] = 0U;
  }
}

/**
  * @brief Update CLLR for all static queue nodes.
  * @param p_q       Pointer to a hal_q_t structure that contains queue information
  * @param operation The operation type
  */
static void DMA_List_UpdateStaticQueueNodesCLLR(hal_q_t *p_q, uint32_t operation)
{
  uint32_t currentnode_addr = (uint32_t)p_q->p_head_node;
  uint32_t current_cllr_offset = (uint32_t)((hal_dma_node_t *)p_q->p_head_node)->info;
  uint32_t cllr_default_offset = (uint32_t)HAL_DMA_NODE_LINEAR_ADDRESSING;
  uint32_t cllr_default_mask = 0U;
  uint32_t cllr_mask;
  uint32_t node_idx = 0U;

  DMA_List_GetCLLRNodeInfo((const hal_dma_node_t *)p_q->p_head_node, &cllr_default_mask, &cllr_default_offset);

  /*  Repeat for all register nodes (Bypass last queue node) */
  while (node_idx < p_q->node_nbr)
  {
    if (operation == DMA_UPDATE_CLLR_POSITION)
    {
      cllr_mask = ((hal_dma_node_t *)currentnode_addr)->regs[current_cllr_offset];
    }
    else
    {
      cllr_mask = (((hal_dma_node_t *)currentnode_addr)->regs[((hal_dma_node_t *)currentnode_addr)->info] &
                   DMA_CLLR_LA) | cllr_default_mask;
    }

    /* Set new CLLR value to default position */
    if ((node_idx == (p_q->node_nbr - 1U)) && (p_q->p_first_circular_node == NULL))
    {
      ((hal_dma_node_t *)(currentnode_addr))->regs[cllr_default_offset] = 0U;
    }
    else
    {
      ((hal_dma_node_t *)(currentnode_addr))->regs[cllr_default_offset] = cllr_mask;
    }

    currentnode_addr = (currentnode_addr & DMA_CLBAR_LBA) | (cllr_mask & DMA_CLLR_LA);

    /* Update current CLLR offset with next CLLR offset */
    if (((hal_dma_node_t *)currentnode_addr)->info == (uint32_t)HAL_DMA_NODE_LINEAR_ADDRESSING)
    {
      current_cllr_offset = ((hal_dma_node_t *)currentnode_addr)->info;
    }
    else
    {
      current_cllr_offset = (((hal_dma_node_t *)currentnode_addr)->info >> 8U);
    }

    node_idx++;
  }
}

/**
  * @brief Check nodes types compatibility.
  * @param p_node     Pointer to a @ref hal_dma_node_t structure that contains linked list node registers configurations
  * @param p_cllr_mask   Pointer to CLLR register mask value
  * @param p_cllr_offset Pointer to CLLR register offset value
  */
static void DMA_List_GetCLLRNodeInfo(const hal_dma_node_t *p_node, uint32_t *p_cllr_mask, uint32_t *p_cllr_offset)
{
  if ((p_node->info & (uint32_t)HAL_DMA_NODE_LINEAR_ADDRESSING) == (uint32_t)HAL_DMA_NODE_LINEAR_ADDRESSING)
  {
    *p_cllr_mask = DMA_CLLR_UT1 | DMA_CLLR_UT2 | DMA_CLLR_UB1 | DMA_CLLR_USA | DMA_CLLR_UDA | DMA_CLLR_ULL;

    if (p_cllr_offset != NULL)
    {
      *p_cllr_offset = (uint32_t)HAL_DMA_NODE_LINEAR_ADDRESSING;
    }
  }
}

/**
  * @brief Format the node according to unused registers.
  * @param p_node  Pointer to a @ref hal_dma_node_t structure that contains linked list node registers configurations
  * @param reg_idx The first register index to be formatted
  * @param reg_nbr The number of node registers
  * @param format  The format type
  */
static void DMA_List_FormatNode(hal_dma_node_t *p_node, uint32_t reg_idx, uint32_t reg_nbr, uint32_t format)
{
  if (format == DMA_NODE_DYNAMIC_FORMAT)
  {
    for (uint32_t reg_id = reg_idx; reg_id < (reg_nbr - 1U); reg_id++)
    {
      p_node->regs[reg_id] = p_node->regs[reg_id + 1U];
    }
  }
  else
  {
    for (uint32_t reg_id = (reg_nbr - 2U); reg_id > reg_idx; reg_id--)
    {
      p_node->regs[reg_id] = p_node->regs[reg_id - 1U];
    }
  }
}

/**
  * @brief Clear unused register fields.
  * @param p_node             Pointer to a @ref hal_dma_node_t structure that contains linked list node registers
  *                           configurations
  * @param first_unused_field The first unused field to be cleared
  */
static void DMA_List_ClearUnusedFields(hal_dma_node_t *p_node, uint32_t first_unused_field)
{
  for (uint32_t reg_idx = first_unused_field; reg_idx < DMA_NODE_REGISTER_NUM; reg_idx++)
  {
    p_node->regs[reg_idx] = 0U;
  }
}

#endif /* USE_HAL_DMA_LINKEDLIST */

/**
  * @brief Start the DMA channel direct transfer.
  * @param hdma       Pointer to DMA channel handle
  * @param src_addr   Source address
  * @param dest_addr  Destination address
  * @param size_byte  Size in byte
  * @param interrupts DMA optional interrupts to be enabled.
  *                   This parameter can be one of @ref DMA_Optional_Interrupt group.
  */
static void DMA_StartDirectXfer(hal_dma_handle_t *hdma, uint32_t src_addr, uint32_t dest_addr, uint32_t size_byte,
                                uint32_t interrupts)
{
  LL_DMA_ConfigAddresses(DMA_CHANNEL_GET_INSTANCE(hdma), src_addr, dest_addr);
  LL_DMA_SetBlkDataLength(DMA_CHANNEL_GET_INSTANCE(hdma), size_byte);

  LL_DMA_ClearFlag(DMA_CHANNEL_GET_INSTANCE(hdma), LL_DMA_FLAG_ALL);

  LL_DMA_DisableIT(DMA_CHANNEL_GET_INSTANCE(hdma), LL_DMA_IT_ALL);

  if (interrupts != HAL_DMA_OPT_IT_SILENT)
  {
    LL_DMA_EnableIT(DMA_CHANNEL_GET_INSTANCE(hdma), (LL_DMA_IT_TC  | LL_DMA_IT_DTE | LL_DMA_IT_ULE | LL_DMA_IT_USE |
                                                     interrupts));
  }

