MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_dma.c
  LL_DMA_ConfigLinkUpdate(DMA_CHANNEL_GET_INSTANCE(hdma), 0U, 0U);

  LL_DMA_EnableChannel(DMA_CHANNEL_GET_INSTANCE(hdma));
}

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
/**
  * @brief Start the DMA channel linked list transfer.
  * @param hdma        Pointer to DMA channel handle
  * @param p_head_node Pointer to hal_q_t node structure
  * @param interrupts  DMA optional interrupts to be enabled.
  *                    This parameter can be one of @ref DMA_Optional_Interrupt group.
  */
static void DMA_StartLinkedListXfer(hal_dma_handle_t *hdma, const void *p_head_node, uint32_t interrupts)
{
  uint32_t update_bits = LL_DMA_UPDATE_CTR1 | LL_DMA_UPDATE_CTR2 | LL_DMA_UPDATE_CBR1 |
                         LL_DMA_UPDATE_CSAR | LL_DMA_UPDATE_CDAR | LL_DMA_UPDATE_CLLR;

  LL_DMA_SetLinkedListBaseAddr(DMA_CHANNEL_GET_INSTANCE(hdma), (uint32_t)p_head_node);

  LL_DMA_ConfigLinkUpdate(DMA_CHANNEL_GET_INSTANCE(hdma), update_bits, ((uint32_t)p_head_node & DMA_CLLR_LA));

  LL_DMA_ClearFlag(DMA_CHANNEL_GET_INSTANCE(hdma), LL_DMA_FLAG_ALL);

  LL_DMA_DisableIT(DMA_CHANNEL_GET_INSTANCE(hdma), LL_DMA_IT_ALL);

  if (interrupts != HAL_DMA_OPT_IT_SILENT)
  {
    LL_DMA_EnableIT(DMA_CHANNEL_GET_INSTANCE(hdma), (LL_DMA_IT_TC  | LL_DMA_IT_DTE | LL_DMA_IT_ULE | LL_DMA_IT_USE |
                                                     interrupts));
  }

  LL_DMA_SetBlkDataLength(DMA_CHANNEL_GET_INSTANCE(hdma), 0U);

  LL_DMA_EnableChannel(DMA_CHANNEL_GET_INSTANCE(hdma));
}
#endif /* USE_HAL_DMA_LINKEDLIST */

/**
  * @brief  Handle the DMA channel error interrupt.
  * @param  hdma      Pointer to DMA channel handle
  * @param  error_msk Mask of errors flags
  */
static void DMA_HandleErrorIT(hal_dma_handle_t *hdma, uint32_t error_msk)
{
#if defined(USE_HAL_DMA_GET_LAST_ERRORS) && (USE_HAL_DMA_GET_LAST_ERRORS == 1)
  /* Check the data transfer error flag */
  if ((error_msk & LL_DMA_FLAG_DTE) != 0U)
  {
    hdma->last_error_codes |= HAL_DMA_ERROR_DTE;
  }

  /* Check the user setting error flag */
  if ((error_msk & LL_DMA_FLAG_USE) != 0U)
  {
    hdma->last_error_codes |= HAL_DMA_ERROR_USE;
  }

#if defined (USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  /* Check the update link error flag */
  if ((error_msk & LL_DMA_FLAG_ULE) != 0U)
  {
    hdma->last_error_codes |= HAL_DMA_ERROR_ULE;
  }
#endif /* USE_HAL_DMA_LINKEDLIST */

  /* Check trigger overrun flag */
  if ((error_msk & LL_DMA_FLAG_TO) != 0U)
  {
    hdma->last_error_codes |= HAL_DMA_ERROR_TO;
  }
#endif /* USE_HAL_DMA_GET_LAST_ERRORS */

  LL_DMA_ClearFlag(DMA_CHANNEL_GET_INSTANCE(hdma), LL_DMA_FLAG_ALL);

  /* Check error flags */
  if ((error_msk & HAL_DMA_FLAG_ERROR) != 0U)
  {
    /* This code is not run when only DMA trigger overrun error occurs */

    LL_DMA_ResetChannel(DMA_CHANNEL_GET_INSTANCE(hdma));

    LL_DMA_DisableIT(DMA_CHANNEL_GET_INSTANCE(hdma), LL_DMA_IT_ALL);

    hdma->global_state = HAL_DMA_STATE_IDLE;
  }

  hdma->p_xfer_error_cb(hdma);

}
/**
  * @}
  */

/**
  * @}
  */

#endif /* USE_HAL_DMA_MODULE */
#endif /* (defined (LPDMA1) || defined (LPDMA2)) */

/**
  * @}
  */
